{
  "alerts": {
    "already_there_alert": "Já se encontra em {location}. Chegou ao seu destino.",
    "path_not_found_alert": "Encontra-se em {location}. Caminho não encontrado.",
    "at_location_alert": "Encontra-se em: {location}",
    "navigation_cancelled_alert": "Navegação cancelada",
    "searching_alert": "A procurar...",
    "end_of_route_alert": "Fim da rota",
    "voice_start_alert": "Vamos iniciar a navegação com o destino {destination}.",
    "voice_unavailable_alert": "Destino não se encontra disponível, repita por favor.",
    "voice_selected_alert": "Destino favorito selecionado: {destination}",
    "start_navigation_alert": "Vamos iniciar a navegação com o destino {destination}",
    "timeout_alert": "Tempo limite de áudio excedido. Por favor, tente novamente.",
    "no_match_alert": "Não foi possível reconhecer o que disse. Por favor, tente novamente.",
    "navigation_end_alert": "Navegação concluida. Obrigado por usar a nossa aplicação!"
  },

  "beacons": {
    "Beacon 1": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço encontram-se a Sala dos Atos, a Entrada Principal e a zona de Perdidos e Achados.",
      "beacon_destinations": ["Sala dos Atos", "Entrada Principal", "Perdidos e Achados"],
      "beacon_connections": ["Beacon 2", "Beacon 3"],
      "beacon_instructions": {

        "Beacon 1-Entrada Principal": "Dê cinco passos em direção à Entrada Principal e chegará ao seu destino: Entrada Principal",
        "Beacon 2-Beacon 1-Entrada Principal": "Dê aproximadamente 3 passos à direita seguidos de mais cinco passos à direita e chegará ao seu destino: Entrada Principal",
        "Beacon 3-Beacon 1-Entrada Principal": "Dê aproximadamente 5 passos em frente e chegará ao seu destino: Entrada Principal ",

        "Beacon 1-Perdidos e Achados": "Dê aproximadamente cinco passos em direção aos perdidos e achados, e chegará ao seu destino: Perdidos e Achados",
        "Beacon 2-Beacon 1-Perdidos e Achados": "Dê aproximadamente sete passos à direita e chegará ao seu destino: Perdidos e Achados",
        "Beacon 3-Beacon 1-Perdidos e Achados": "Dê aproximadamente cinco passos em frente seguidos de mais quatro passos à esquerda e chegará ao seu destino: Perdidos e Achados",

        "Beacon 1-Sala dos Atos": " Dê aproximadamente cinco passos e suba 11 degraus em direção à Sala dos Atos e chegará ao seu destino: Sala dos Atos",
        "Beacon 2-Beacon 1-Sala dos Atos": "Dê aproximadamente 4 passos em frente, vire à esquerda e suba 11 degraus e chegará ao seu destino: Sala dos Atos ",
        "Beacon 3-Beacon 1-Sala dos Atos": "Dê aproximadamente três passos em frente seguidos de mais quatro passos à direita, suba 11 degraus e chegará ao seu destino: Sala dos Atos ",

        "Beacon 1-Beacon 2": "Encontre umas escadas à sua esquerda. Desça 6 degraus e dê cinco passos à direita Encontre umas escadas à sua esquerda. Desça 6 degraus e dê cinco passos à direita ",
        "Beacon 3-Beacon 1-Beacon 2": "Dê aproximadamente seis passos em frente, encontre umas escadas à direita. Desça 6 degraus e dê cinco passos à direita.",

        "Beacon 1-Beacon 3": "Dê aproximadamente dezassete passos em frente",
        "Beacon 2-Beacon 1-Beacon 3": "-----------Dê aproximadamente vinte passos em frente "
      }
    },

    "Beacon 2": {
      "beacon_floor": "-1",
      "beacon_description": "Neste local encontram-se as escadas que utilizou para descer, bem como um corredor que o conduzirá às salas 13, 14 e 15 correspondente",
      "beacon_destinations": ["Sala 13", "Sala 14", "Sala 15"],
      "beacon_connections": ["Beacon 1"],
      "beacon_instructions": {

        "Beacon 1-Beacon 2-Sala 13": "Vire à direita e dê aproximadamente 7 passos. Ao passar a porta chegará ao seu destino: sala13",
        "Beacon 2-Sala 13": "Dê aproximadamente 7 passos em direção à sala 13. Ao passar a porta chegará ao seu destino: sala13",

        "Beacon 1-Beacon 2-Sala 14": "Vire à direita e dê aproximadamente 14 passos e chegará ao seu destino: sala 14",
        "Beacon 2-Sala 14": "Dê aproximadamente 14 passos em direção à sala 14 e chegará ao seu destino: sala 14",

        "Beacon 1-Beacon 2-Sala 15": "Vire à direita e dê aproximadamente 21 passos e chegará ao seu destino: sala 15",
        "Beacon 2-Sala 15": "Dê aproximadamente 21 passos em direção à sala 15 e chegará ao seu destino: sala 15",

        "Beacon 2-Beacon 1": "Dê aproximadamente cinco passos à sua esquerda e suba seis degraus"
      }
    },

    "Beacon 3": {
      "beacon_floor": "0",
      "beacon_description": "Está no centro do Pátio Principal da UAL. À sua volta encontra-se a saída da universidade, o busto de Camões e as escadas de acesso ao interior da universidade.",
      "beacon_destinations": ["Pátio"],
      "beacon_connections": ["Beacon 1", "Beacon 4", "Beacon 8", "Beacon 15"],
      "beacon_instructions": {

        "Beacon 1-Beacon 3-Pátio": "Dê aproximadamente três passos e chegará ao seu destino: Pátio ",
        "Beacon 3-Pátio": "Encontra-se no Pátio",
        "Beacon 4-Beacon 3-Pátio": "Dê aproximadamente três passos e chegará ao seu destino: Pátio ",
        "Beacon 8-Beacon 3-Pátio": "Dê aproximadamente três passos e chegará ao seu destino: Pátio ",
        "Beacon 15-Beacon 3-Pátio": "Dê aproximadamente três passos e chegará ao seu destino: Pátio ",

        "Beacon 3-Beacon 1": "Dê aproximadamente dezassete passos em direção à entrada",
        "Beacon 4-Beacon 3-Beacon 1": "Dê aproximadamente dezassete passos à esquerda ",
        "Beacon 8-Beacon 3-Beacon 1": "Dê aproximadamente dezassete passos à esquerda",
        "Beacon 15-Beacon 3-Beacon 1": "Dê aproximadamente 20 passos em frente",

        "Beacon 1-Beacon 3-Beacon 4": "Dê aproximadamente sete passos à direita e suba pelas escadas da direita oito degraus, seguidos de mais dois degraus à esquerda",
        "Beacon 3-Beacon 4": "Dê aproximadamente sete passos em direção às escadas inferiores, suba pelas escadas da direita oito degraus, seguidos de mais dois degraus à esquerda",
        "Beacon 8-Beacon 3-Beacon 4": "Dê aproximadamente sete passos à esquerda e suba pelas escadas da direita oito degraus, seguidos de mais dois degraus à esquerda",
        "Beacon 15-Beacon 3-Beacon 4": "Dê aproximadamente sete passos à esquerda e suba pelas escadas da direita oito degraus, seguidos de mais dois degraus à esquerda",

        "Beacon 1-Beacon 3-Beacon 8": "Dê aproximadamente sete passos à direita e suba pelas escadas da esquerda oito degraus, seguidos de mais dois degraus à direita",
        "Beacon 3-Beacon 8": "Dê aproximadamente sete passos em direção às escadas superiores, suba pelas escadas da esquerda oito degraus, seguidos de mais dois degraus à direita",
        "Beacon 4-Beacon 3-Beacon 8": "Dê aproximadamente sete passos à direita e suba pelas escadas da esquerda oito degraus, seguidos de mais dois degraus à direita",
        "Beacon 15-Beacon 3-Beacon 8": "Dê aproximadamente sete passos à esquerda e suba pelas escadas da esquerda oito degraus, seguidos de mais dois degraus à direita",

        "Beacon 1-Beacon 3-Beacon 15": "Dê aproximadamente vinte passos em frente e suba dois degraus",
        "Beacon 3-Beacon 15": "Dê aproximadamente vinte passos em frente e suba dois degraus",
        "Beacon 4-Beacon 3-Beacon 15": "Dê aproximadamente doze passos à frente e suba dois degraus",
        "Beacon 8-Beacon 3-Beacon 15": "Dê aproximadamente doze passos em frente e suba dois degraus"
      }
    },

    "Beacon 4": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço, à sua frente está a loja dos trajes académicos, à sua esquerda a Associação de Estudantes e à sua direita as salas vinte e quatro a trinta e três, os auditórios dois e três e o Gabinete de Erasmus.",
      "beacon_destinations": ["Auditório 02", "Auditório 03", "Sala 22", "Sala 23"],
      "beacon_connections": ["Beacon 3", "Beacon 5", "Beacon 8", "Beacon 9"],
      "beacon_instructions": {

        "Beacon 3-Beacon 4-Auditório 02": "Vire à direita e dê sete passos seguidos de mais sete passos à esquerda e chegará ao seu destino: Auditório 2",
        "Beacon 4-Auditório 02": "Dê aproximadamente sete passos seguidos de mais sete passos à esquerda em direção ao auditório 2 e chegará ao seu destino: Auditório 2",
        "Beacon 8-Beacon 4-Auditório 02": "Dê aproximadamente 11 passos em frente seguidos de sete passos à esquerda e chegará ao seu destino: Auditório 2",
        "Beacon 9-Beacon 4-Auditório 02": "Dê aproximadamente 11 passos em frente seguidos de sete passos à esquerda e chegará ao seu destino: Auditório 2",

        "Beacon 3-Beacon 4-Auditório 03": "Vire à direita, dê nove passos e chegará ao seu destino: Auditório 3",
        "Beacon 4-Auditório 03": "Dê nove passos em direção ao auditório 3 e chegará ao seu destino: Auditório 3",
        "Beacon 5-Beacon 4-Auditório 03": "Dê aproximadamente 9 passos à esquerda e chegará ao seu destino: Auditório 3",
        "Beacon 8-Beacon 4-Auditório 03": "Dê aproximadamente 12 passos em frente e chegará ao seu destino: Auditório 3",
        "Beacon 9-Beacon 4-Auditório 03": "Dê aproximadamente 12 passos em frente e chegará ao seu destino: Auditório 3",

        "Beacon 3-Beacon 4-Sala 22": "Dê aproximadamente 9 passos em frente e chegará ao seu destino: Sala 22",
        "Beacon 4-Sala 22": "Dê aproximadamente 9 passos em direção à sala 22 e chegará ao seu destino: Sala 22",
        "Beacon 5-Beacon 4-Sala 22": "Vire à direita, dê aproximadamente 5 passos seguidos de mais 9 passos à direita e chegará ao seu destino: Sala 22",
        "Beacon 8-Beacon 4-Sala 22": "Vire à esquerda, dê aproximadamente 6 passos e chegará ao seu destino: Sala 22",
        "Beacon 9-Beacon 4-Sala 22": "Vire à esquerda e dê aproximadamente 9 passos e chegará ao seu destino: Sala 22",

        "Beacon 3-Beacon 4-Sala 23": "Dê aproximadamente 6 passos em frente, seguidos de mais 8 passos à direita e chegará ao seu destino: Sala 23",
        "Beacon 4-Sala 23": "Dê aproximadamente 6 passos em frente, seguidos de mais 8 passos em direção à sala 23 e chegará ao seu destino: Sala 23",
        "Beacon 5-Beacon 4-Sala 23": "Dê aproximadamente 9 passos à esquerda seguidos de mais 5 passos à esquerda e chegará ao seu destino: Sala 23",
        "Beacon 8-Beacon 4-Sala 23": "Dê aproximadamente 9 passos em frente, seguidos de mais 5 passos à esquerda e chegará ao seu destino: Sala 23",
        "Beacon 9-Beacon 4-Sala 23": "Dê aproximadamente 9 passos em frente, seguidos de mais 5 passos à esquerda e chegará ao seu destino: Sala 23",

        "Beacon 4-Beacon 3": "Ao passar a porta vire à direita e desça 8 degraus, vire à esquerda e dê sete passos",
        "Beacon 5-Beacon 4-Beacon 3": "Vire à direita e dê aproximadamente 5 passos, seguidos de mais 2 passos à esquerda. Ao passar a porta, vire à direita e desça 8 degraus",
        "Beacon 8-Beacon 4-Beacon 3": "Dê aproximadamente 5 passos em frente, seguidos de mais 2 passos à direita. Ao passar a porta, vire à direita e desça 8 degraus",
        "Beacon 9-Beacon 4-Beacon 3": "Vire à esquerda e dê aproximadamente 5 passos, seguidos de mais 2 passos à direita. Ao passar a porta, vire à direita e desça 8 degraus",

        "Beacon 3-Beacon 4-Beacon 5": "Vire à direita e dê aproximadamente 5 passos, seguidos de mais 15 passos à esquerda",
        "Beacon 4-Beacon 5": "Vire à direita e dê aproximadamente 6 passos, seguidos de mais 15 passos à esquerda",
        "Beacon 8-Beacon 4-Beacon 5": "Dê aproximadamente 13 passos em frente, seguidos de mais 15 passos à esquerda",
        "Beacon 9-Beacon 4-Beacon 5": "Dê aproximadamente 13 passos em frente, seguidos de mais 15 passos à esquerda",

        "Beacon 3-Beacon 4-Beacon 8": "Vire à esquerda e dê aproximadamente 13 passos",
        "Beacon 4-Beacon 8": "Dê aproximadamente 13 passos em direção às escadas superiores",
        "Beacon 5-Beacon 4-Beacon 8": "Vire à direita e dê aproximadamente 15 passos",
        "Beacon 9-Beacon 4-Beacon 8": "Vire à direita e dê aproximadamente 7 passos ",

        "Beacon 3-Beacon 4-Beacon 9": "Vire à esquerda e dê aproximadamente 7 passos, seguidos de mais 10 passos à direita",
        "Beacon 4-Beacon 9": "Dê aproximadamente 7 passos em direção às escadas superiores, seguidos de mais 10 passos à direita",
        "Beacon 5-Beacon 4-Beacon 9": "Dê aproximadamente 13 passos em frente, seguidos de mais 15 passos à esquerda",
        "Beacon 8-Beacon 4-Beacon 9": "------------------------------------------------"
      }
    },

    "Beacon 5": {
      "beacon_floor": "0",
      "beacon_description": "Neste corredor encontram-se as salas 24, 27, 28 e 29, por esta ordem. Também encontrará o Gabinete de Erasmus e o Coro Académico.",
      "beacon_destinations": ["Auditório 02", "Sala 24", "Sala 27", "Gabinete de Erasmus"],
      "beacon_connections": ["Beacon 4", "Beacon 6"],
      "beacon_instructions": {

        "Beacon 5-Auditório 02": "Dê aproximadamente 5 passos em direção ao auditório 2 e chegará ao seu destino: auditório 2",
        "Beacon 6-Beacon 5-Auditório 02": "Dê aproximadamente 4 passos em frente seguidos de 2 passos à esquerda e chegará ao seu destino: auditório 2",

        "Beacon 4-Beacon 5-Gabinete de Erasmus": "Dê aproximadamente 4 passos em frente seguidos de 2 passos à esquerda e chegará ao seu destino: Gabinete de Erasmus",
        "Beacon 5-Gabinete de Erasmus": "Dê 4 passos em direção ao gabinete de erasmus e chegará ao seu destino: gabinete de erasmus",
        "Beacon 6-Beacon 5-Gabinete de Erasmus": "Vire à direita e dê aproximadamente 4 passos e chegará ao seu destino: gabinete de erasmus",

        "Beacon 4-Beacon 5-Sala 24": "Vire à esquerda, dê aproximadamente 4 passos e chegará ao seu destino: sala 24",
        "Beacon 5-Sala 24": "Dê aproximadamente 3 passos em direção à sala 24 e chegará ao seu destino: sala 24",
        "Beacon 6-Beacon 5-Sala 24": "Dê aproximadamente 6 passos em frente, seguidos de mais 3 passos à direita e chegará ao seu destino: sala 24",

        "Beacon 4-Beacon 5-Sala 27": "Dê aproximadamente 18 passos em frente seguidos de 2 à esquerda e chegará ao seu destino: sala 27",
        "Beacon 5-Sala 27": "Dê aproximadamente 15 passos em direção à sala 27 e chegará ao seu destino: sala 27",

        "Beacon 5-Beacon 4": "Dê aproximadamente 25 passos em direção às escadas inferiores",
        "Beacon 6-Beacon 5-Beacon 4": "Dê aproximadamente 28 passos em frente",

        "Beacon 4-Beacon 5-Beacon 6": "Dê aproximadamente 30 passos em frente",
        "Beacon 5-Beacon 6": "Dê aproximadamente 27 passos ao final do corredor"
      }
    },


    "Beacon 6": {
      "beacon_floor": "0",
      "beacon_description": "À sua direita encontram-se as escadas que descem para as salas 32 e 33. À sua esquerda encontram-se as salas 28 e 29.",
      "beacon_destinations": ["Sala 27","Sala 28", "Sala 29"],
      "beacon_connections": ["Beacon 5", "Beacon 7"],
      "beacon_instructions": {

        "Beacon 6-Sala 27": "Dê aproximadamente 12 passos, seguidos de 3 passos à direita em direção à sala 27 e chegará ao seu destino: sala 27",
        "Beacon 7-Beacon 6-Sala 27": "Vire à esquerda e dê aproximadamente 12 passos, seguidos de 3 passos à direita em direção à sala 27 e chegará ao seu destino: sala 27",

        "Beacon 5-Beacon 6-Sala 28": "Dê aproximadamente 5 passos em frente seguidos de mais 7 passos à direita e chegará ao seu destino: sala 28",
        "Beacon 6-Sala 28": "Dê aproximadamente 5 passos, seguidos de 7 passos à direita em direção à sala 28 e chegará ao seu destino: sala 28",
        "Beacon 7-Beacon 6-Sala 28": "-------Vire à direita e dê aproximadamente 3 passos seguidos de mais 7 passos à direita e chegará ao seu destino: sala 28",

        "Beacon 5-Beacon 6-Sala 29": "Dê aproximadamente 5 passos em frente seguidos de mais 7 passos à direita. Em seguida vire à esquerda e dê aproximadamente 10 passos e chegará ao seu destino: sala 29",
        "Beacon 6-Sala 29": "Dê aproximadamente 5 passos em frente seguidos de mais 7 passos à direita. Em seguida vire à esquerda e dê aproximadamente 10 passos em direção à sala 29 e chegará ao seu destino: sala 29",

        "Beacon 6-Beacon 5": "Dê aproximadamente 27 passos em direção ao início do corredor",
        "Beacon 7-Beacon 6-Beacon 5": "Vire à esquerda e dê aproximadamente 27 passos",

        "Beacon 5-Beacon 6-Beacon 7": "Vire à direita e desça 8 degraus seguidos de mais 5 degraus à esquerda. Em seguida dê 5 passos em frente",
        "Beacon 6-Beacon 7": "Encontre umas escadas e desça 8 degraus seguidos de mais 5 degraus à esquerda. Em seguida dê 5 passos em frente"
      }
    },

    "Beacon 7": {
      "beacon_floor": "-1",
      "beacon_description": "Este corredor irá levá-lo a duas salas: à sua direita está a Sala 32 e à sua esquerda está a Sala 33.",
      "beacon_destinations": ["Sala 32", "Sala 33"],
      "beacon_connections": ["Beacon 6"],
      "beacon_instructions": {

        "Beacon 6-Beacon 7-Sala 32": "Vire à direita e dê aproximadamente 7 passos e chegará ao seu destino: sala 32",
        "Beacon 7-Sala 32": "Dê aproximadamente 7 passos em direção à sala 32 e chegará ao seu destino: sala 32",

        "Beacon 6-Beacon 7-Sala 33": "Vire à direita e dê aproximadamente 3 passos e chegará ao seu destino: sala 33",
        "Beacon 7-Sala 33": "Dê aproximadamente 3 passos em direção à sala 33 e chegará ao seu destino: sala 33",

        "Beacon 7-Beacon 6": "Dê aproximadamente 6 passos, encontre umas escadas e suba 5 degraus seguidos de 8 degraus à direita"
      }
    },

    "Beacon 8": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço tem umas escadas que o irão levar ao Pátio Principal, um corredor que o irá levar ao piso 1 e outro corredor que o irá levar a salas, bar e Associação de Estudantes.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 3", "Beacon 4", "Beacon 9", "Beacon 22"],
      "beacon_instructions": {

        "Beacon 4-Beacon 8-Beacon 3": "Vire à esquerda e desça 8 degraus, seguidos de 7 passos à direita",
        "Beacon 8-Beacon 3": "Encontre umas escadas, desça 8 degraus e dê 7 passos à direita",
        "Beacon 9-Beacon 8-Beacon 3": "Vire à esquerda, desça 8 degraus e dê 7 passos à direita",
        "Beacon 22-Beacon 8-Beacon 3": "Vire à direita, desça 8 degraus e dê 7 passos à direita",

        "Beacon 3-Beacon 8-Beacon 4": "Vire à direita e dê aproximadamente 13 passos",
        "Beacon 8-Beacon 4": "Dê aproximadamente 13 passos em direção às escadas inferiores",
        "Beacon 9-Beacon 8-Beacon 4": "Vire à esquerda e dê aproximadamente 10 passos",
        "Beacon 22-Beacon 8-Beacon 4": "Dê aproximadamente 13 passos",

        "Beacon 3-Beacon 8-Beacon 9": "Vire à direita e dê aproximadamente 6 passos seguidos de mais 4 passos à esquerda",
        "Beacon 4-Beacon 8-Beacon 9": "Não faz sentido",
        "Beacon 8-Beacon 9": "Dê aproximadamente 6 passos seguidos de 4 à esquerda em direção às escadas do bar",
        "Beacon 22-Beacon 8-Beacon 9": "Dê aproximadamente 8 passos em frente seguidos de 4 passos à esquerda",

        "Beacon 3-Beacon 8-Beacon 22": "Vire à esquerda e dê aproximadamente 10 passos em frente e suba 3 degraus",
        "Beacon 4-Beacon 8-Beacon 22": "Dê aproximadamente 10 passos em frente e suba 3 degraus",
        "Beacon 8-Beacon 22": "Dê aproximadamente 10 passos no final do corredor",
        "Beacon 9-Beacon 8-Beacon 22": "Vire à direita, dê aproximadamente 10 passos em frente e suba 3 degraus"
      }
    },


    "Beacon 9": {
      "beacon_floor": "0",
      "beacon_description": "À sua volta encontra-se a Associação de Estudantes à direita, à sua esquerda a loja dos trajes académicos e em frente as escadas que o levarão ao Bar/Cantina.",
      "beacon_destinations": ["Associação Académica", "Loja Académica"],
      "beacon_connections": ["Beacon 4", "Beacon 8", "Beacon 10"],
      "beacon_instructions": {

        "Beacon 4-Beacon 9-Associação Académica": "Vire à direita e dê aproximadamente 5 passos, seguidos de mais 2 passos à esquerda e chegará ao seu destino: associação académica",
        "Beacon 8-Beacon 9-Associação Académica": "Dê aproximadamente 3 passos em frente, seguidos de mais 2 passos à esquerda e chegará ao seu destino: associação académica",
        "Beacon 9-Associação Académica": "Dê aproximadamente 5 passos em direção à associação académica e chegará ao seu destino: associação académica",
        "Beacon 10-Beacon 9-Associação Académica": "Dê aproximadamente 4 passos em frente, seguidos de mais 3 passos à direita e chegará ao seu destino: associação académica",

        "Beacon 4-Beacon 9-Loja Académica": "Vire à direita e dê aproximadamente 2 passos: loja académica",
        "Beacon 8-Beacon 9-Loja Académica": "Vire à esquerda e dê aproximadamente 2 passos e chegará ao seu destino: loja académica",
        "Beacon 9-Loja Académica": "Dê aproximadamente 2 passos em direção à loja académica e chegará ao seu destino: loja académica",
        "Beacon 10-Beacon 9-Loja Académica": "Vire à direita e dê aproximadamente 4 passos, seguidos de 2 passos à esquerda e chegará ao seu destino: loja académica",

        "Beacon 8-Beacon 9-Beacon 4": "Não faz sentido",
        "Beacon 9-Beacon 4": "Dê aproximadamente 5 passos em frente, seguidos de mais 6 passos à esquerda",
        "Beacon 10-Beacon 9-Beacon 4": "Dê aproximadamente 7 passos em frente, seguidos de mais 6 passos à esquerda",

        "Beacon 4-Beacon 9-Beacon 8": "Não faz sentido",
        "Beacon 9-Beacon 8": "Dê aproximadamente 5 passos em frente, seguidos de mais 6 passos à direita em direção às escadas superiores",
        "Beacon 10-Beacon 9-Beacon 8": "Dê aproximadamente 7 passos em frente, seguidos de mais 6 passos à direita",

        "Beacon 4-Beacon 9-Beacon 10": "Vire à direita e dê aproximadamente 10 passos, desça 6 degraus, seguidos de mais 12 degraus à esquerda",
        "Beacon 8-Beacon 9-Beacon 10": "Vire à esquerda e dê aproximadamente 10 passos e desça 6 degraus, seguidos de mais 12 degraus à esquerda",
        "Beacon 9-Beacon 10": "Dê aproximadamente 10 passos no final do corredor e desça 6 degraus, seguidos de mais 12 degraus à esquerda"
      }
    },

    "Beacon 10": {
      "beacon_floor": "-1",
      "beacon_description": "Neste espaço encontra-se à sua direita o Bar/Cantina, os Cacifos e em frente as escadas que o irão levar para o piso 0.",
      "beacon_destinations": ["Cacifos", "Bar"],
      "beacon_connections": ["Beacon 9", "Beacon 11", "Beacon 12"],
      "beacon_instructions": {

        "Beacon 9-Beacon 10-Bar": "Dê aproximadamente 3 passos em frente seguidos de mais 4 passos à esquerda. Ao passar por uma porta chegará ao seu destino: bar",
        "Beacon 10-Bar": "Dê aproximadamente 8 passos em direção ao bar e chegará ao seu destino: bar",
        "Beacon 11-Beacon 10-Bar": "Dê aproximadamente 8 passos à esquerda. Ao passar por uma porta chegará ao seu destino: bar",

        "Beacon 9-Beacon 10-Cacifos": "Dê aproximadamente 3 passos em frente e chegará ao seu destino: cacifos",
        "Beacon 10-Cacifos": "Dê aproximadamente 3 passos em direção aos cacifos e chegará ao seu destino: cacifos",
        "Beacon 11-Beacon 10-Cacifos": "Dê aproximadamente 4 passos em frente e chegará ao seu destino: cacifos",
        "Beacon 12-Beacon 10-Cacifos": "Dê aproximadamente 3 passos em frente e chegará ao seu destino: cacifos",

        "Beacon 10-Beacon 9": "Encontre umas escadas e suba 12 degraus seguidos de mais 6 degraus à direita. E dê aproximadamente 5 passos à direita",
        "Beacon 11-Beacon 10-Beacon 9": "Encontre umas escadas e suba 12 degraus seguidos de mais 6 degraus à direita. E dê aproximadamente 5 passos à direita",
        "Beacon 12-Beacon 10-Beacon 9": "Encontre umas escadas e suba 12 degraus seguidos de mais 6 degraus à direita. E dê aproximadamente 5 passos à direita",

        "Beacon 9-Beacon 10-Beacon 11": "Vire à direita e dê 2 passos seguidos de mais 10 passos à direita",
        "Beacon 10-Beacon 11": "Vire à direita e dê 2 passos seguidos de mais 10 passos à direita",
        "Beacon 12-Beacon 10-Beacon 11": "Dê aproximadamente 4 passos em frente seguidos de mais 10 passos à direita",

        "Beacon 9-Beacon 10-Beacon 12": "Dê aproximadamente 3 passos em frente seguidos de mais 4 passos à esquerda. Ao passar por uma porta dê 5 passos",
        "Beacon 10-Beacon 12": "Dê aproximadamente 3 passos em frente seguidos de mais 4 passos à esquerda. Ao passar por uma porta dê 5 passos",
        "Beacon 11-Beacon 10-Beacon 12": "Dê aproximadamente 7 passos à esquerda. Ao passar por uma porta dê 5 passos"
      }
    },

    "Beacon 11": {
      "beacon_floor": "-1",
      "beacon_description": "Onde se encontra, tem à sua frente a esplanada exterior, à sua direita o caminho para o bar e atrás de si as escadas que o levam para o piso zero.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 10", "Beacon 13"],
      "beacon_instructions": {

        "Beacon 11-Beacon 10": "Dê aproximadamente 10 passos em direção às escadas do bar",
        "Beacon 13-Beacon 11-Beacon 10": "Vire à esquerda e dê aproximadamente 10 passos",

        "Beacon 10-Beacon 11-Beacon 13": "Vire à direita e dê aproximadamente 9 passos",
        "Beacon 11-Beacon 13": "Dê aproximadamente 9 passos em direção à sala dos micro-ondas"
      }
    },

    "Beacon 12": {
      "beacon_floor": "-1",
      "beacon_description": "Neste momento você encontra-se no Bar. À sua esquerda tem a esplanada interior e à sua direita a saída.",
      "beacon_destinations": ["Bar", "Refeitório"],
      "beacon_connections": ["Beacon 10", "Beacon 13"],
      "beacon_instructions": {

        "Beacon 12-Bar": "Dê 3 passos em direção ao bar e chegará ao seu destino: bar",
        "Beacon 13-Beacon 12-Bar": "Dê 3 passos em frente e chegará ao seu destino: bar",

        "Beacon 10-Beacon 12-Refeitório": "Vire à esquerda e dê aproximadamente 5 passos e chegará ao seu destino: refeitório",
        "Beacon 12-Refeitório": "Dê aproximadamente 3 passos em direção ao refeitório e chegará ao seu destino: refeitório",

        "Beacon 12-Beacon 10": "Dê aproximadamente 8 passos em direção às escadas do bar",
        "Beacon 13-Beacon 12-Beacon 10": "Vire à esquerda e dê aproximadamente 13 passos",

        "Beacon 10-Beacon 12-Beacon 13": "Vire à esquerda e dê aproximadamente 13 passos",
        "Beacon 12-Beacon 13": "Dê aproximadamente 13 passos em direção à sala dos micro-ondas"
      }
    },

    "Beacon 13": {
      "beacon_floor": "-1",
      "beacon_description": "Onde se encontra, tem à sua esquerda uma porta que o levará para a secção dos micro-ondas, para a esplanada exterior e para a esplanada interior.",
      "beacon_destinations": ["Sala dos Micro-ondas", "Refeitório", "Esplanada"],
      "beacon_connections": ["Beacon 11", "Beacon 12", "Beacon 14"],
      "beacon_instructions": {

        "Beacon 11-Beacon 13-Esplanada": "Vire à esquerda, dê aproximadamente 10 passos e chegará ao seu destino: esplanada",
        "Beacon 12-Beacon 13-Esplanada": "Vire à direita, dê aproximadamente 10 passos e chegará ao seu destino: esplanada",
        "Beacon 13-Esplanada": "Dê aproximadamente 10 passos em direção à esplanada e chegará ao seu destino: esplanada",

        "Beacon 11-Beacon 13-Refeitório": "Dê aproximadamente 3 passos em frente e ao passar a porta chegará ao seu destino: refeitório",
        "Beacon 13-Refeitório": "Dê aproximadamente 3 passos em direção ao refeitório e chegará ao seu destino: refeitório",
        "Beacon 14-Beacon 13-Refeitório": "Vire à esquerda, dê aproximadamente 3 passos e ao passar a porta chegará ao seu destino: refeitório",

        "Beacon 11-Beacon 13-Sala dos Micro-ondas": "Vire à direita e chegará ao seu destino: sala dos micro-ondas",
        "Beacon 12-Beacon 13-Sala dos Micro-ondas": "Ao passar a porta vire à esquerda e chegará ao seu destino: sala dos micro-ondas",
        "Beacon 13-Sala dos Micro-ondas": "Ao passar a porta dê aproximadamente 1 passo em direção à sala dos micro-ondas e chegará ao seu destino: sala dos micro-ondas",
        "Beacon 14-Beacon 13-Sala dos Micro-ondas": "Dê 3 passos em frente e chegará ao seu destino: sala dos micro-ondas",

        "Beacon 12-Beacon 13-Beacon 11": "Vire à esquerda e ao passar a porta, dê aproximadamente 10 passos em frente",
        "Beacon 13-Beacon 11": "Ao passar a porta dê aproximadamente 10 passos em direção ao fim do corredor",
        "Beacon 14-Beacon 13-Beacon 11": "Vire à direita e dê aproximadamente 10 passos",

        "Beacon 11-Beacon 13-Beacon 12": "Ao passar por uma porta, dê aproximadamente 5 passos em frente seguidos de mais 10 passos à direita",
        "Beacon 13-Beacon 12": "Dê aproximadamente 5 passos em frente seguidos de mais 10 passos à direita em direção ao bar",
        "Beacon 14-Beacon 13-Beacon 12": "Vire à esquerda, ao passar por uma porta vire à direita e dê aproximadamente 5 passos em frente seguidos de mais 10 passos à direita",

        "Beacon 11-Beacon 13-Beacon 14": "Vire à esquerda e dê aproximadamente 19 passos",
        "Beacon 12-Beacon 13-Beacon 14": "Ao passar por uma porta, vire à direita e dê aproximadamente 19 passos",
        "Beacon 13-Beacon 14": "Dê aproximadamente 19 passos em direção à livraria"
      }
    },

    "Beacon 14": {
      "beacon_floor": "-1",
      "beacon_description": "Neste espaço, tem à sua frente a esplanada exterior e, à sua direita, a entrada da reprografia e as casas de banho.",
      "beacon_destinations": ["Livraria", "Esplanada", "WC Bar"],
      "beacon_connections": ["Beacon 13"],
      "beacon_instructions": {

        "Beacon 14-Esplanada": "Dê 9 passos em direção à esplanada e chegará ao seu destino: esplanada",

        "Beacon 13-Beacon 14-Livraria": "Vire à direita, ao passar por uma porta chegará ao seu destino: livraria",
        "Beacon 14-Livraria": "Dê aproximadamente 1 passo em direção à livraria, ao passar uma porta chegará ao seu destino: livraria",

        "Beacon 13-Beacon 14-WC Bar": "Em frente suba 5 degraus e chegará ao seu destino: wc bar",
        "Beacon 14-WC Bar": "Suba 5 degraus em direção à WC bar e chegará ao seu destino: wc bar",

        "Beacon 14-Beacon 13": "Dê aproximadamente 19 passos em direção ao refeitório"
      }
    },

    "Beacon 15": {
      "beacon_floor": "0",
      "beacon_description": "Chegou ao busto de Luís de Camões. À sua direita encontram-se as escadas para as salas 37 a 70, o UAL Media, o Auditório 1, o Centro de Informática e as casas de banho. À sua esquerda encontram-se as escadas para as salas 10, 16 e 18, as salas 80 a 90, a biblioteca e os laboratórios de psicologia. Também encontrará, neste espaço, a porta de acesso ao Pátio Principal.",
      "beacon_destinations": ["Estátua do Camões"],
      "beacon_connections": ["Beacon 3", "Beacon 16", "Beacon 22"],
      "beacon_instructions": {

        "Beacon 3-Beacon 15-Estátua do Camões": "Encontre umas escadas, suba 2 degraus e chegará ao seu destino: estátua do Camões",
        "Beacon 15-Estátua do Camões": "Encontra-se na estátua de Camões",
        "Beacon 16-Beacon 15-Estátua do Camões": "Encontra-se na estátua de Camões",
        "Beacon 22-Beacon 15-Estátua do Camões": "Encontra-se na estátua de Camões",

        "Beacon 15-Beacon 3": "Encontre umas escadas, desça 2 degraus e dê aproximadamente 11 passos em direção ao pátio central",
        "Beacon 16-Beacon 15-Beacon 3": "Vire à direita, encontre umas escadas e desça 2 degraus seguidos de mais 11 passos em frente",
        "Beacon 22-Beacon 15-Beacon 3": "Vire à esquerda, encontre umas escadas e desça 2 degraus seguidos de mais 11 passos em frente",

        "Beacon 3-Beacon 15-Beacon 16": "Virá à esquerda e suba 10 degraus",
        "Beacon 15-Beacon 16": "Encontre umas escadas e suba 10 degraus",
        "Beacon 22-Beacon 15-Beacon 16": "Em frente suba 10 degraus",

        "Beacon 3-Beacon 15-Beacon 22": "Vire à direita e suba 12 degraus",
        "Beacon 15-Beacon 22": "Encontre umas escadas e suba 12 degraus",
        "Beacon 16-Beacon 15-Beacon 22": "Em frente suba 12 degraus"
      }
    },

    "Beacon 16": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço, encontrará umas escadas que, ao subir, dão acesso às salas 80 a 90, à sala 10, aos laboratórios de psicologia, à Autónoma 24, sala de estudos, e à biblioteca. À sua esquerda encontra-se a sala 18. Também encontrará umas escadas que, ao descer, levam à sala 16.",
      "beacon_destinations": ["Sala 10", "Livros de Ponto"],
      "beacon_connections": ["Beacon 15", "Beacon 17", "Beacon 19"],
      "beacon_instructions": {

        "Beacon 15-Beacon 16-Livros de Ponto": "Vire à esquerda, dê aproximadamente 2 passos e chegará ao seu destino: Livros de Ponto",
        "Beacon 16-Livros de Ponto": "Dê aproximadamente 2 passos em direção aos livros de ponto e chegará ao seu destino: Livros de Ponto",
        "Beacon 17-Beacon 16-Livros de Ponto": "Vire à direita, dê aproximadamente 2 passos e chegará ao seu destino: Livros de Ponto",
        "Beacon 19-Beacon 16-Livros de Ponto": "Dê aproximadamente 4 passos em frente seguidos de mais 2 passos à direita e chegará ao seu destino: Livros de Ponto",

        "Beacon 15-Beacon 16-Sala 10": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê 4 passos em frente e chegará ao seu destino: sala 10",
        "Beacon 16-Sala 10": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê 4 passos em frente e chegará ao seu destino: sala 10",
        "Beacon 17-Beacon 16-Sala 10": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê 4 passos em frente e chegará ao seu destino: sala 10",

        "Beacon 16-Beacon 15": "Encontre umas escadas e desça 10 degraus",
        "Beacon 17-Beacon 16-Beacon 15": "Dê aproximadamente 6 passos em frente e desça 10 degraus",
        "Beacon 19-Beacon 16-Beacon 15": "Dê aproximadamente 5 passos em frente e desça 10 degraus",

        "Beacon 15-Beacon 16-Beacon 17": "Dê aproximadamente 5 passos em frente seguidos de mais 9 passos à esquerda",
        "Beacon 16-Beacon 17": "Dê aproximadamente 5 passos em frente seguidos de mais 9 passos à esquerda em direção à sala 18",
        "Beacon 19-Beacon 16-Beacon 17": "Vire à direita e dê aproximadamente 11 passos",

        "Beacon 15-Beacon 16-Beacon 19": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê aproximadamente 6 passos à esquerda",
        "Beacon 16-Beacon 19": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê aproximadamente 6 passos à esquerda",
        "Beacon 17-Beacon 16-Beacon 19": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê aproximadamente 6 passos à esquerda"
      }
    },

    "Beacon 17": {
      "beacon_floor": "0",
      "beacon_description": "À sua esquerda encontra-se a sala 18 e à sua direita umas escadas que o levarão ao piso -1.",
      "beacon_destinations": ["Sala 18"],
      "beacon_connections": ["Beacon 16", "Beacon 18"],
      "beacon_instructions": {

        "Beacon 16-Beacon 17-Sala 18": "Vire à esquerda, dê aproximadamente 2 passos e chegará ao seu destino: sala 18",
        "Beacon 17-Sala 18": "Dê aproximadamente 2 passos em direção à sala 18 e chegará ao seu destino: sala 18",
        "Beacon 18-Beacon 17-Sala 18": "Dê aproximadamente 2 passos em frente e chegará ao seu destino: sala 18",

        "Beacon 17-Beacon 16": "Dê aproximadamente 11 passos em direção aos livros de ponto",
        "Beacon 18-Beacon 17-Beacon 16": "Vire à esquerda e dê aproximadamente 14 passos",

        "Beacon 16-Beacon 17-Beacon 18": "Encontre umas escadas, desça 13 degraus seguidos de mais 4 degraus",
        "Beacon 17-Beacon 18": "Encontre umas escadas, desça 13 degraus seguidos de mais 4 degraus"
      }
    },

    "Beacon 18": {
      "beacon_floor": "-1",
      "beacon_description": "Nesta área encontra-se a sala 16 à sua frente.",
      "beacon_destinations": ["Sala 16"],
      "beacon_connections": ["Beacon 17"],
      "beacon_instructions": {

        "Beacon 17-Beacon 18-Sala 16": "Vire à direita, dê aproximadamente 5 passos e chegará ao seu destino: sala 16",
        "Beacon 18-Sala 16": "Dê aproximadamente 5 passos em direção à sala 16 e chegará ao seu destino: sala 16",

        "Beacon 18-Beacon 17": "Encontre umas escadas, suba quatros degraus seguidos de mais doze degraus"
      }
    },

    "Beacon 19": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço onde se encontra, tem à sua direita a sala 10, à sua esquerda encontra-se uma escada que dá acesso às salas do piso dois, à biblioteca e à Sala de Computadores.",
      "beacon_destinations": ["Sala 10", "Sala de Computadores", "Biblioteca", "GIRU"],
      "beacon_connections": ["Beacon 16", "Beacon 20", "Beacon 21"],
      "beacon_instructions": {

        "Beacon 16-Beacon 19-Biblioteca": "Dê aproximadamente 2 passos à esquerda e chegará ao seu destino: biblioteca",
        "Beacon 19-Biblioteca": "Dê aproximadamente 2 passos em direção à biblioteca e chegou ao seu destino: biblioteca",
        "Beacon 20-Beacon 19-Biblioteca": "Dê aproximadamente 5 passos em frente seguidos de mais 2 passos à esquerda, e chegará ao seu destino: biblioteca",
        "Beacon 21-Beacon 19-Biblioteca": "Dê aproximadamente 3 passos em frente e chegará ao seu destino: biblioteca",

        "Beacon 16-Beacon 19-GIRU": "Vire à esquerda, dê aproximadamente 15 passos e chegará ao seu destino: GIRU",
        "Beacon 19-GIRU": "Dê aproximadamente 13 passos em direção ao GIRU e chegará ao seu destino: GIRU",
        "Beacon 21-Beacon 19-GIRU": "Vire à esquerda, dê aproximadamente 10 passos e chegará ao seu destino: GIRU",

        "Beacon 19-Sala 10": "Dê aproximadamente 12 passos em direção à sala 10 e chegará ao seu destino: sala 10",
        "Beacon 20-Beacon 19-Sala 10": "Dê aproximadamente 15 passos seguidos de mais 5 passos à direita e chegará ao seu destino: sala 10",
        "Beacon 21-Beacon 19-Sala 10": "Vire à direita, dê aproximadamente 6 passos seguidos de mais 5 passos à direita e chegará ao seu destino: sala 10",

        "Beacon 16-Beacon 19-Sala de Computadores": "Vire à esquerda, dê aproximadamente 13 passos seguidos de mais 3 passos à esquerda e chegará ao seu destino: sala dos computadores",
        "Beacon 19-Sala de Computadores": "Dê aproximadamente 13 passos em direção à sala dos computadores seguidos de mais 3 passos à esquerda e chegará ao seu destino: sala dos computadores",
        "Beacon 21-Beacon 19-Sala de Computadores": "Vire à esquerda, dê aproximadamente 12 passos seguidos de mais 3 passos à esquerda e chegará ao seu destino: sala dos computadores",

        "Beacon 19-Beacon 16": "Dê aproximadamente 8 passos em direção à sala 10 seguidos de mais 6 passos à direita. Desça 13 degraus seguidos de mais 7 degraus",
        "Beacon 20-Beacon 19-Beacon 16": "Dê aproximadamente 8 passos em frente seguidos de mais 6 passos à direita. Desça 13 degraus seguidos de mais 7 degraus",
        "Beacon 21-Beacon 19-Beacon 16": "Vire à direita, dê aproximadamente 8 passos seguidos de mais 6 passos à direita. Desça 13 degraus seguidos de mais 7 degraus",

        "Beacon 16-Beacon 19-Beacon 20": "Vire à esquerda e dê aproximadamente 15 passos",
        "Beacon 19-Beacon 20": "Dê aproximadamente 13 passos em direção à sala de estudo",
        "Beacon 21-Beacon 19-Beacon 20": "Vire à esquerda e dê aproximadamente 13 passos",

        "Beacon 16-Beacon 19-Beacon 21": "Vire à esquerda e dê 2 passos, encontre umas escadas e suba 10 degraus",
        "Beacon 19-Beacon 21": "Encontre umas escadas e suba 10 degraus",
        "Beacon 20-Beacon 19-Beacon 21": "Vire à direita, encontre umas escadas e suba 10 degraus"
      }
    },

    "Beacon 20": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço à sua frente encontram-se as salas de estudo com computadores e sem, e à sua direita umas escadas para o pátio superior.",
      "beacon_destinations": ["Sala de Estudo", "Sala de Computadores", "GIRU"],
      "beacon_connections": ["Beacon 19", "Beacon 37"],
      "beacon_instructions": {

        "Beacon 20-GIRU": "Dê aproximadamente 4 passos em direção à GIRU e chegará ao seu destino: GIRU",
        "Beacon 37-Beacon 20-GIRU": "Vire à esquerda, dê aproximadamente 4 passos e chegará ao seu destino: GIRU",

        "Beacon 19-Beacon 20-Sala de Estudo": "Dê aproximadamente 6 passos em frente e ao passar pela porta chegará ao seu destino: sala de estudo",
        "Beacon 20-Sala de Estudo": "Dê aproximadamente 4 passos em direção à sala de estudo e chegará ao seu destino: sala de estudo",
        "Beacon 37-Beacon 20-Sala de Estudo": "Vire à direita, dê aproximadamente 6 passos e chegará ao seu destino: sala de estudo",

        "Beacon 20-Sala de Computadores": "Dê aproximadamente 5 passos em direção à sala de computadores e chegará ao seu destino: sala de computadores",
        "Beacon 37-Beacon 20-Sala de Computadores": "Dê aproximadamente 5 passos em frente seguidos de mais 5 passos à esquerda e chegará ao seu destino: sala de computadores",

        "Beacon 20-Beacon 19": "Dê aproximadamente 13 passos em direção à biblioteca",
        "Beacon 37-Beacon 20-Beacon 19": "Vire à direita e dê 9 passos. Encontre umas escadas e suba 2 degraus",

        "Beacon 19-Beacon 20-Beacon 37": "Vire à esquerda e dê aproximadamente 13 passos",
        "Beacon 20-Beacon 37": "Dê aproximadamente 9 passos em direção ao final do corredor. Encontre umas escadas e suba 2 degraus"
      }
    },

    "Beacon 21": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço tem à sua esquerda as salas 82 e 83, o Laboratório de Neurociências e o Laboratório de Psicometria. À sua direita encontram-se as salas 81 e 80, por esta ordem.",
      "beacon_destinations": ["Sala 80", "Sala 81", "Sala 82", "Sala 83", "Laboratórios de Psicologia"],
      "beacon_connections": ["Beacon 19"],
      "beacon_instructions": {

        "Beacon 19-Beacon 21-Laboratórios de Psicologia": "Vire à esquerda, dê aproximadamente 15 passos e chegará ao seu destino: Laboratório de Psicologia",
        "Beacon 21-Laboratórios de Psicologia": "Dê aproximadamente 15 passos em direção ao laboratório de psicologia e chegará ao seu destino: Laboratório de Psicologia",

        "Beacon 19-Beacon 21-Sala 80": "Vire à direita, suba 11 degraus seguidos de aproximadamente 8 passos à direita e chegará ao seu destino: sala 80",
        "Beacon 21-Sala 80": "Encontre umas escadas, suba 11 degraus seguidos de aproximadamente 8 passos à direita e chegará ao seu destino: sala 80",

        "Beacon 19-Beacon 21-Sala 81": "Vire à direita, suba 11 degraus seguidos de aproximadamente 4 passos à direita e chegará ao seu destino: sala 81",
        "Beacon 21-Sala 81": "Encontre umas escadas, suba 11 degraus seguidos de aproximadamente 4 passos à direita e chegará ao seu destino: sala 81",

        "Beacon 19-Beacon 21-Sala 82": "Vire à esquerda, suba 11 degraus seguidos de aproximadamente 7 passos em frente e chegará ao seu destino: sala 82",
        "Beacon 21-Sala 82": "Encontre umas escadas, suba 11 degraus seguidos de aproximadamente 7 passos em frente e chegará ao seu destino: sala 82",

        "Beacon 19-Beacon 21-Sala 83": "Vire à esquerda, suba 11 degraus seguidos de aproximadamente 9 passos em frente e chegará ao seu destino: sala 83",
        "Beacon 21-Sala 83": "Encontre umas escadas, suba 11 degraus seguidos de aproximadamente 9 passos em frente e chegará ao seu destino: sala 83",

        "Beacon 21-Beacon 19": "Encontre umas escadas e desça 11 degraus"
      }
    },

    "Beacon 22": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço você tem as escadas que o irão levar ao piso 1, Pátio Principal e Bar.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 8", "Beacon 15", "Beacon 23"],
      "beacon_instructions": {

        "Beacon 15-Beacon 22-Beacon 8": "Suba 4 degraus, vire à direita, desça 3 degraus e dê aproximadamente 7 passos em frente",
        "Beacon 22-Beacon 8": "Encontre umas escadas, desça 3 degraus e dê aproximadamente 7 passos em frente",
        "Beacon 23-Beacon 22-Beacon 8": "Desça 5 degraus seguidos de mais 3 degraus à esquerda e dê aproximadamente 7 passos em frente",

        "Beacon 8-Beacon 22-Beacon 15": "Encontre umas escadas, suba 3 degraus, vire à esquerda e desça 4 degraus seguidos de mais 9 degraus",
        "Beacon 22-Beacon 15": "Encontre umas escadas, suba 3 degraus, vire à esquerda e desça 4 degraus seguidos de mais 9 degraus",
        "Beacon 23-Beacon 22-Beacon 15": "Desça 9 degraus seguidos de mais 3 degraus",

        "Beacon 8-Beacon 22-Beacon 23": "Encontre umas escadas, suba 3 degraus seguidos de mais 5 degraus à direita. De seguida, suba 13 degraus",
        "Beacon 15-Beacon 22-Beacon 23": "Encontre umas escadas, suba 3 degraus seguidos de mais 13 degraus à direita. De seguida, suba 13 degraus",
        "Beacon 22-Beacon 23": "Encontre umas escadas, suba 3 degraus seguidos de mais 5 degraus à direita. De seguida, suba 13 degraus"
      }
    },

    "Beacon 23": {
      "beacon_floor": "1",
      "beacon_description": "À sua direita encontram-se as salas 37 a 45, a sala 90 e o auditório 1; à sua esquerda encontram-se as salas 54 a 70, o centro de informática, o UAL Media, as casas de banho e as escadas para regressar ao Pátio Principal.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 22", "Beacon 24", "Beacon 33"],
      "beacon_instructions": {

        "Beacon 23-Beacon 22": "Encontre umas escadas e desça 13 degraus",
        "Beacon 24-Beacon 23-Beacon 22": "Vire à direita. Encontre umas escadas e desça 13 degraus",
        "Beacon 33-Beacon 23-Beacon 22": "Vire à esquerda. Encontre umas escadas e desça 13 degraus",

        "Beacon 22-Beacon 23-Beacon 24": "Vire à esquerda e dê aproximadamente 7 passos seguidos de mais 6 passos à direita",
        "Beacon 23-Beacon 24": "Dê aproximadamente 7 passos em direção ao inicio do ccorredor. seguidos de mais 6 passos à direita",
        "Beacon 33-Beacon 23-Beacon 24": "Dê aproximadamente 11 passos em frente seguidos de mais 6 passos à direita",

        "Beacon 22-Beacon 23-Beacon 33": "Vire à direita, ao passar por uma porta. Vire novamente à direita e dê  aproximadamente 8 passos. De seguida suba 12 degraus seguidos de mais 5 degraus",
        "Beacon 23-Beacon 33": "Vire à direita, ao passar por uma porta vire novamente à direita e dê  aproximadamente 8 passos. De seguida suba 12 degraus  seguidos de mais 5 degraus.",
        "Beacon 24-Beacon 23-Beacon 33": "Dê aproximadamente 8 passos em frente seguidos de mais 8 passos à direita. Suba 12 degraus seguidos de mais 5 degraus"
      }
    },

    "Beacon 24": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço encontram-se a sala 58, casas de banho e a entrada dos laboratórios de ciências da comunicação.",
      "beacon_destinations": ["Sala 58"],
      "beacon_connections": ["Beacon 23", "Beacon 25", "Beacon 27"],
      "beacon_instructions": {

        "Beacon 23-Beacon 24-Sala 58": "Dê aproximadamente 15 passos em frente e chegará ao seu destino: sala 58",
        "Beacon 24-Sala 58": "Dê aproximadamente 15 passos em direção à sala 58 e chegará ao seu destino: sala 58",
        "Beacon 27-Beacon 24-Sala 58": "Dê aproximadamente 15 passos à esquerda e chegará ao seu destino: sala 58",

        "Beacon 24-Beacon 23": "Ao passar por uma porta dê aproximadamente 10 passos em frente seguidos de mais 6 passos à esquerda",
        "Beacon 25-Beacon 24-Beacon 23": "Dê aproximadamente 9 passos em frente seguidos de mais 6 passos à esquerda",
        "Beacon 27-Beacon 24-Beacon 23": "Vire à direita e dê aproximadamente 9 passos seguidos de mais 6 passos à esquerda",

        "Beacon 23-Beacon 24-Beacon 25": "Dê aproximadamente 9 passos em frente seguidos de mais 3 passos à direita",
        "Beacon 24-Beacon 25": "Dê aproximadamente 13 passos em direção à sala 58 seguidos de mais 3 passos à direita",
        "Beacon 27-Beacon 24-Beacon 25": "Vire à esquerda e dê aproximadamente 13 passos seguidos de mais 3 passos à direita",

        "Beacon 23-Beacon 24-Beacon 27": "Dê aproximadamente 6 passos em frente seguidos de mais 10 passos à esquerda",
        "Beacon 24-Beacon 27": "Dê aproximadamente 10 passos em direção ao WC do piso 1",
        "Beacon 25-Beacon 24-Beacon 27": "Vire à direita e dê aproximadamente 10 passos"
      }
    },

    "Beacon 25": {
      "beacon_floor": "1",
      "beacon_description": "Nesta área encontram-se os laboratórios de ciências da comunicação, a UAL Media e a sala 56.",
      "beacon_destinations": ["Sala 58", "UAL Media"],
      "beacon_connections": ["Beacon 24", "Beacon 26", "Beacon 28"],
      "beacon_instructions": {

        "Beacon 24-Beacon 25-UAL Media": "Vire à direita, dê aproximadamente 7 passos, seguidos de mais 5 passos à esquerda e chegará ao seu destino: UAL Media",
        "Beacon 25-UAL Media": "Dê aproximadamente 12 passos em direção à UAL Media e chegará ao seu destino: UAL Media",
        "Beacon 26-Beacon 25-UAL Media": "Vire à esquerda e dê aproximadamente 9 passos em frente seguidos de mais 4 passos à esquerda e chegará ao seu destino: UAL media",

        "Beacon 28-Beacon 25-Sala 58": "Dê aproximadamente 8 passos em frente seguidos de mais 7 passos à esquerda e chegará ao seu destino: sala 58",
        "Beacon 25-Sala 58": "Dê aproximadamente 7 passos em direção à sala 58 e chegará ao seu destino: sala 58",
        "Beacon 26-Beacon 25-Sala 58": "Dê aproximadamente 3 passos em frente seguidos de mais 5 passos à direita e chegará ao seu destino: sala 58",

        "Beacon 25-Beacon 24": "Dê aproximadamente 9 passos em direção ao início do corredor",
        "Beacon 26-Beacon 25-Beacon 24": "Dê aproximadamente 4 passos em frente seguidos de mais 5 passos à direita. De seguida vire à esquerda e dê 9 passos",
        "Beacon 28-Beacon 25-Beacon 24": "Vire à direita e dê aproximadamente 9 passos",

        "Beacon 24-Beacon 25-Beacon 26": "Encontre umas escadas e suba 17 degraus",
        "Beacon 25-Beacon 26": "Encontre umas escadas e suba 17 degraus",
        "Beacon 28-Beacon 25-Beacon 26": "Vire à direita e dê aproximadamente 15 passos",

        "Beacon 24-Beacon 25-Beacon 28": "Vire à esquerda e dê aproximadamente 15 passos",
        "Beacon 25-Beacon 28": "Vire à direita e dê aproximadamente 15 passos",
        "Beacon 26-Beacon 25-Beacon 28": "Vire à direita e dê aproximadamente 15 passos em direção ao final do corredor"
      }
    },

    "Beacon 26": {
      "beacon_floor": "2",
      "beacon_description": "Nesta área tem à sua esquerda as escadas para a UAL Media e à direita a sala 56.",
      "beacon_destinations": ["Sala 56"],
      "beacon_connections": ["Beacon 25"],
      "beacon_instructions": {

        "Beacon 25-Beacon 26-Sala 56": "Vire à direita, dê aproximadamente 8 passos e chegará ao seu destino: sala 56",
        "Beacon 26-Sala 56": "Dê aproximadamente 8 passos em direção à sala 56 e chegará ao seu destino: sala 56",

        "Beacon 26-Beacon 25": "Encontre umas escadas, desça 17 degraus e dê 3 passos em frente"
      }
    },

    "Beacon 27": {
      "beacon_floor": "1",
      "beacon_description": "Neste corredor você tem logo no início umas escadas à sua esquerda que o irão levar à sala 57; em frente tem a casa de banho dos homens à sua direita e das mulheres à sua esquerda.",
      "beacon_destinations": ["Sala 57", "WC Piso 1"],
      "beacon_connections": ["Beacon 24", "Beacon 28"],
      "beacon_instructions": {

        "Beacon 24-Beacon 27-Sala 57": "Suba um degrau, vire à esquerda e suba 12 degraus. Dê 4 passos em frente e chegará ao seu destino: Sala 57",
        "Beacon 27-Sala 57": "Suba um degrau, vire à esquerda e suba 12 degraus. Dê 4 passos em frente e chegará ao seu destino: sala 57",
        "Beacon 28-Beacon 27-Sala 57": "Suba um degrau, vire à esquerda e suba 12 degraus. Dê 4 passos em frente e chegará ao seu destino: sala 57",

        "Beacon 24-Beacon 27-WC Piso 1": "Vire à esquerda, suba 1 degrau e dê 14 passos em frente e chegará ao seu destino: WC",
        "Beacon 27-WC Piso 1": "Suba um degrau e dê 14 passos em frente e chegará ao seu destino: WC",
        "Beacon 28-Beacon 27-WC Piso 1": "Suba um degrau e dê 14 passos em frente e chegará ao seu destino: WC",

        "Beacon 27-Beacon 24": "Dê aproximadamente 10 passos em direção ao início do corredor",
        "Beacon 28-Beacon 27-Beacon 24": "Vire à esquerda e dê aproximadamente 10 passos",

        "Beacon 24-Beacon 27-Beacon 28": "Vire à direita e dê aproximadamente 7 passos",
        "Beacon 27-Beacon 28": "Dê aproximadamente 7 passos em direção ao final do corredor"
      }
    },

    "Beacon 28": {
      "beacon_floor": "1",
      "beacon_description": "Neste momento você se encontra num corredor em que, por esta respetiva ordem, vai encontrar à sua direita a sala 59 e à sua esquerda as salas 60 e 61.",
      "beacon_destinations": ["Sala 54", "Sala 58", "Sala 59"],
      "beacon_connections": ["Beacon 25", "Beacon 27", "Beacon 29"],
      "beacon_instructions": {

        "Beacon 25-Beacon 28-Sala 54": "Dê aproximadamente 6 passos em frente seguidos de mais 2 passos à esquerda e chegará ao seu destino: sala 54",
        "Beacon 27-Beacon 28-Sala 54": "Vire à esquerda, dê aproximadamente 6 passos seguidos de mais 2 passos à esquerda e chegará ao seu destino: sala 54",
        "Beacon 28-Sala 54": "Dê aproximadamente 6 passos em direção à sala 54 e chegará ao seu destino: sala 54",
        "Beacon 29-Beacon 28-Sala 54": "Vire à direita e chegará ao seu destino: sala 54",

        "Beacon 27-Beacon 28-Sala 58": "Dê aproximadamente 4 passos em frente e chegará ao seu destino: sala 58",
        "Beacon 28-Sala 58": "Dê aproximadamente 4 passos em direção à sala 58 e chegará ao seu destino: sala 58",
        "Beacon 29-Beacon 28-Sala 58": "Dê aproximadamente 4 passos em frente, ao passar por uma porta vire à esquerda e chegará ao seu destino: sala 58",

        "Beacon 25-Beacon 28-Sala 59": "Dê aproximadamente 6 passos em frente seguidos de mais 2 passos à direita e chegará ao seu destino: sala 59",
        "Beacon 27-Beacon 28-Sala 59": "Vire à esquerda, dê aproximadamente 6 passos seguidos de mais 2 passos à direita e chegará ao seu destino: sala 59",
        "Beacon 28-Sala 59": "Dê aproximadamente 6 passos em direção à sala 59 e chegará ao seu destino: sala 59",

        "Beacon 27-Beacon 28-Beacon 25": "Vire à direita e dê aproximadamente 15 passos em frente",
        "Beacon 28-Beacon 25": "Dê aproximadamente 15 passos em frente",
        "Beacon 29-Beacon 28-Beacon 25": "Ao passar por uma porta dê aproximadamente 17 passos em frente",

        "Beacon 25-Beacon 28-Beacon 27": "Dê aproximadamente 7 passos em direção ao WC do piso 1",
        "Beacon 28-Beacon 27": "Dê aproximadamente 7 passos em direção ao WC do piso 1",
        "Beacon 29-Beacon 28-Beacon 27": "Ao passar por uma porta vire à direita e dê aproximadamente 7 passos",

        "Beacon 25-Beacon 28-Beacon 29": "Ao passar por uma porta dê aproximadamente 15 passos em frente",
        "Beacon 27-Beacon 28-Beacon 29": "Vire à esquerda, ao passar por uma porta dê aproximadamente 15 passos",
        "Beacon 28-Beacon 29": "Dê aproximadamente 15 passos em direção ao final do corredor"
      }
    },

    "Beacon 29": {
      "beacon_floor": "1",
      "beacon_description": "Você neste momento encontra-se no meio do corredor onde tem as salas 60 e 61 à sua esquerda e a sala 59 à sua direita.",
      "beacon_destinations": ["Sala 59", "Sala 60", "Sala 61"],
      "beacon_connections": ["Beacon 28", "Beacon 30"],
      "beacon_instructions": {

        "Beacon 28-Beacon 29-Sala 59": "Ao passar uma porta vire à esquerda, dê aproximadamente 3 passos e chegará ao seu destino: sala 59",
        "Beacon 29-Sala 59": "Dê aproximadamente 3 passos em direção à sala 59 e chegará ao seu destino: sala 59",
        "Beacon 30-Beacon 29-Sala 59": "Ao passar uma porta vire à esquerda, dê aproximadamente 3 passos e chegará ao seu destino: sala 59",

        "Beacon 28-Beacon 29-Sala 60": "Ao passar uma porta vire à esquerda, dê aproximadamente 2 passos e chegará ao seu destino: sala 60",
        "Beacon 29-Sala 60": "Dê aproximadamente 2 passos em direção à sala 60 e chegará ao seu destino: sala 60",
        "Beacon 30-Beacon 29-Sala 60": "Ao passar uma porta vire à direita, dê aproximadamente 2 passos e chegará ao seu destino: sala 60",

        "Beacon 28-Beacon 29-Sala 61": "Ao passar uma porta vire à esquerda, dê aproximadamente 6 passos em frente e chegará ao seu destino: sala 61",
        "Beacon 29-Sala 61": "Dê aproximadamente 3 passos em direção à sala 61 e chegará ao seu destino: sala 61",

        "Beacon 29-Beacon 28": "Dê aproximadamente 15 passos em direção ao final do corredor",
        "Beacon 30-Beacon 29-Beacon 28": "Ao passar por uma porta dê aproximadamente 15 passos em frente",

        "Beacon 28-Beacon 29-Beacon 30": "Ao passar por uma porta dê aproximadamente 8 passos em frente",
        "Beacon 29-Beacon 30": "Dê aproximadamente 8 passos em direção à sala 62"
      }
    },

    "Beacon 30": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço à sua direita está a sala 62 e à sua esquerda encontram-se umas escadas que o irão levar às salas 63 a 70.",
      "beacon_destinations": ["Sala 61", "Sala 62", "Sala 63"],
      "beacon_connections": ["Beacon 29", "Beacon 31"],
      "beacon_instructions": {

        "Beacon 30-Sala 61": "Dê aproximadamente 3 passos em direção à sala 61 e chegará ao seu destino: sala 61",
        "Beacon 31-Beacon 30-Sala 61": "Vire à direita. Ao passar por uma porta dê aproximadamente 2 passos à direita e chegará ao seu destino: sala 61",

        "Beacon 29-Beacon 30-Sala 62": "Dê aproximadamente 5 passos em frente seguidos de mais 8 passos à direita e chegará ao seu destino: sala 62",
        "Beacon 30-Sala 62": "Dê aproximadamente 8 passos em direção à sala 62 e chegará ao seu destino: sala 62",
        "Beacon 31-Beacon 30-Sala 62": "Dê aproximadamente 8 passos em frente e chegará ao seu destino: sala 62",

        "Beacon 29-Beacon 30-Sala 63": "Dê aproximadamente 6 passos à direita seguidos de mais 9 passos à esquerda e chegará ao seu destino: sala 63",
        "Beacon 30-Sala 63": "Dê aproximadamente 15 passos em direção à sala 63 e chegará ao seu destino: sala 63",
        "Beacon 31-Beacon 30-Sala 63": "Dê aproximadamente 6 passos em frente seguidos de mais 9 passos à esquerda e chegará ao seu destino: sala 63",

        "Beacon 30-Beacon 29": "Dê aproximadamente 8 passos em direção ao início do corredor",
        "Beacon 31-Beacon 30-Beacon 29": "Vire à direita. Ao passar por uma porta dê aproximadamente 3 passos em frente",

        "Beacon 29-Beacon 30-Beacon 31": "Ao passar por uma porta vire à esquerda. Dê aproximadamente 8 passos e suba 8 degraus",
        "Beacon 30-Beacon 31": "Dê aproximadamente 8 passos, encontre umas escadas e suba 9 degraus seguidos de mais 8 degraus"
     }
    },

    "Beacon 31": {
      "beacon_floor": "2",
      "beacon_description": "Onde se encontra tem a sala 65 à sua direita e em frente umas escadas que o levarão a salas e ao centro informático.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 30", "Beacon 32"],
      "beacon_instructions": {

        "Beacon 31-Beacon 30": "Encontre umas escadas. Desça 8 degraus seguidos de mais 9 degraus à direita",
        "Beacon 32-Beacon 31-Beacon 30": "Vire à direita e desça 8 degraus seguidos de mais 9 degraus à direita",

        "Beacon 30-Beacon 31-Beacon 32": "Vire à esquerda e dê aproximadamente 4 passos. Encontre umas escadas e suba 11 degraus",
        "Beacon 31-Beacon 32": "Dê aproximadamente 4 passos em direção às escadas e suba 11 degraus"
      }
    },

    "Beacon 32": {
      "beacon_floor": "2",
      "beacon_description": "Neste corredor encontram-se as salas da 67 à 70 por esta respetiva ordem e o centro de informática.",
      "beacon_destinations": ["Sala 68", "Sala 69", "Sala 70", "Centro de Informática", "Laboratórios ECC"],
      "beacon_connections": ["Beacon 31"],
      "beacon_instructions": {

        "Beacon 31-Beacon 32-Centro de Informática": "Vire à esquerda. Dê aproximadamente 4 passos e chegará ao seu destino: centro de informática",
        "Beacon 32-Centro de Informática": "Dê aproximadamente 4 passos em direção ao centro de informática e chegará ao seu destino: centro de informática",

        "Beacon 31-Beacon 32-Laboratórios ECC": "Vire à direita. Dê aproximadamente 2 passos e chegará ao seu destino: laboratórios de ECC",
        "Beacon 32-Laboratórios ECC": "Dê aproximadamente 2 passos em direção aos ECC e chegará ao seu destino: laboratórios de ECC",

        "Beacon 31-Beacon 32-Sala 68": "Dê aproximadamente 7 passos em direção à sala 68 e chegará ao seu destino: sala 68",
        "Beacon 32-Sala 68": "Dê aproximadamente 7 passos em direção à sala 68 e chegará ao seu destino: sala 68",

        "Beacon 31-Beacon 32-Sala 69": "Dê aproximadamente 17 passos em direção à sala 69 e chegará ao seu destino: sala 69",
        "Beacon 32-Sala 69": "Dê aproximadamente 17 passos em direção à sala 69 e chegará ao seu destino: sala 69",

        "Beacon 31-Beacon 32-Sala 70": "Dê aproximadamente 27 passos em direção à sala 70 e chegará ao seu destino: sala 70",
        "Beacon 32-Sala 70": "Dê aproximadamente 27 passos em direção à sala 70 e chegará ao seu destino: sala 70",

        "Beacon 32-Beacon 31": "Encontre umas escadas. Desça 11 degraus e dê 4 passos em frente"
      }
    },

    "Beacon 33": {
      "beacon_floor": "2",
      "beacon_description": "Você está num corredor onde à direita encontram-se as salas 37 e 38 e à esquerda encontra-se o pátio secundário e casas de banho.",
      "beacon_destinations": ["Sala 37", "Sala 38", "WC Piso 2"],
      "beacon_connections": ["Beacon 23", "Beacon 34", "Beacon 36"],
      "beacon_instructions": {

        "Beacon 23-Beacon 33-Sala 37": "Vire à direita, suba 9 degraus seguidos de mais 2 degraus e chegará ao seu destino: sala 37",
        "Beacon 33-Sala 37": "Encontre umas escadas, suba 9 degraus seguidos de mais 2 degraus e chegará ao seu destino: sala 37",
        "Beacon 34-Beacon 33-Sala 37": "Vire à esquerda, suba 9 degraus e chegará ao seu destino: sala 37",
        "Beacon 36-Beacon 33-Sala 37": "Encontre umas escadas, suba 9 degraus em frente seguidos de mais 2 degraus e chegará ao seu destino: sala 37",

        "Beacon 23-Beacon 33-Sala 38": "Vire à direita, suba 9 degraus e chegará ao seu destino: sala 38",
        "Beacon 33-Sala 38": "Encontre umas escadas, suba 9 degraus e chegará ao seu destino: sala 38",
        "Beacon 34-Beacon 33-Sala 38": "Vire à esquerda, suba 9 degraus e chegará ao seu destino: sala 38",
        "Beacon 36-Beacon 33-Sala 38": "Encontre umas escadas, suba 9 degraus e chegará ao seu destino: sala 38",

        "Beacon 23-Beacon 33-WC Piso 2": "Dê aproximadamente 5 passos em frente. Ao passar por uma porta, encontre umas escadas, suba 8 degraus e chegará ao seu destino: WC piso 2",
        "Beacon 33-WC Piso 2": "Ao passar por uma porta, encontre umas escadas, suba 8 degraus e chegará ao seu destino: WC piso 2",
        "Beacon 34-Beacon 33-WC Piso 2": "Vire à direita. Ao passar por uma porta, encontre 8 degraus e chegará ao seu destino: WC piso 2",

        "Beacon 33-Beacon 23": "Encontre umas escadas, desça 5 degraus seguidos de 12 degraus. Em seguida dê aproximadamente 7 passos em frente seguidos de mais 5 passos à esquerda",
        "Beacon 34-Beacon 33-Beacon 23": "Dê aproximadamente 5 passos em frente. Encontre umas escadas, desça 5 degraus seguidos de 12 degraus. Em seguida dê aproximadamente 7 passos em frente seguidos de mais 5 passos à esquerda",
        "Beacon 36-Beacon 33-Beacon 23": "Encontre umas escadas, desça 5 degraus seguidos de 12 degraus. Em seguida dê aproximadamente 7 passos em frente seguidos de mais 5 passos à esquerda",

        "Beacon 23-Beacon 33-Beacon 34": "Vire à direita e suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda",
        "Beacon 33-Beacon 34": "Suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda",
        "Beacon 36-Beacon 33-Beacon 34": "Vire à esquerda e suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda",

        "Beacon 23-Beacon 33-Beacon 36": "Vire à direita e suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda",
        "Beacon 33-Beacon 36": "Suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda",
        "Beacon 34-Beacon 33-Beacon 36": "Vire à esquerda e suba 9 degraus, seguidos de mais 5 passos em frente e suba mais 7 degraus seguidos de mais 13 degraus à esquerda"
      }
    },

    "Beacon 34": {
      "beacon_floor": "3",
      "beacon_description": "Agora que subiu as escadas encontra-se num corredor onde por esta mesma ordem irá ter as salas 39, 40 e 41.",
      "beacon_destinations": ["Sala 39", "Sala 40", "Sala 41"],
      "beacon_connections": ["Beacon 33", "Beacon 35"],
      "beacon_instructions": {

        "Beacon 33-Beacon 34-Sala 39": "Ir para a Sala 39 passando pelo Beacon 34, vindo do Beacon 33",
        "Beacon 34-Sala 39": "Siga para a Sala 39 a partir daqui",
        "Beacon 35-Beacon 34-Sala 39": "Ir para a Sala 39 passando pelo Beacon 34, vindo do Beacon 35",

        "Beacon 33-Beacon 34-Sala 40": "Ir para a Sala 40 passando pelo Beacon 34, vindo do Beacon 33",
        "Beacon 34-Sala 40": "Siga para a Sala 40 a partir daqui",
        "Beacon 35-Beacon 34-Sala 40": "Ir para a Sala 40 passando pelo Beacon 34, vindo do Beacon 35",

        "Beacon 33-Beacon 34-Sala 41": "Ir para a Sala 41 passando pelo Beacon 34, vindo do Beacon 33",
        "Beacon 34-Sala 41": "Siga para a Sala 41 a partir daqui",
        "Beacon 35-Beacon 34-Sala 41": "Ir para a Sala 41 passando pelo Beacon 34, vindo do Beacon 35",

        "Beacon 34-Beacon 33": "Siga para o Beacon 33 a partir daqui",
        "Beacon 35-Beacon 34-Beacon 33": "Ir para o Beacon 33 passando pelo Beacon 34, vindo do Beacon 35",

        "Beacon 33-Beacon 34-Beacon 35": "Ir para o Beacon 35 passando pelo Beacon 34, vindo do Beacon 33",
        "Beacon 34-Beacon 35": "Siga para o Beacon 35 a partir daqui"
      }
    },

    "Beacon 35": {
      "beacon_floor": "4",
      "beacon_description": "Neste espaço encontram-se as salas 42, 43, 44 e 45 por esta respetiva ordem.",
      "beacon_destinations": ["Sala 42", "Sala 44", "Sala 45"],
      "beacon_connections": ["Beacon 34"],
      "beacon_instructions": {

        "Beacon 34-Beacon 35-Sala 42": "Dê aproximadamente 4 passos em frente e chegará ao seu destino: sala 42",
        "Beacon 35-Sala 42": "Dê aproximadamente 4 passos em direção à sala 42 e chegará ao seu destino: sala 42",

        "Beacon 34-Beacon 35-Sala 44": "Vire à esquerda e dê aproximadamente 5 passos e chegará ao seu destino: sala 44",
        "Beacon 35-Sala 44": "Dê aproximadamente 5 passos em direção à sala 44 e chegará ao seu destino: sala 44",

        "Beacon 34-Beacon 35-Sala 45": "Vire à esquerda e dê aproximadamente 7 passos e chegará ao seu destino: sala 45",
        "Beacon 35-Sala 45": "Dê aproximadamente 7 passos em direção à sala 45 e chegará ao seu destino: sala 45",

        "Beacon 35-Beacon 34": "Vire à esquerda e desça 19 degraus"
      }
    },

    "Beacon 36": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço estão o Pátio de Enfermagem e o WC do Piso 2.",
      "beacon_destinations": ["Pátio de Enfermagem", "WC Piso 2"],
      "beacon_connections": ["Beacon 33", "Beacon 37", "Beacon 38"],
      "beacon_instructions": {

        "Beacon 33-Beacon 36-Pátio de Enfermagem": "Chegou ao seu destino: Pátio de Enfermagem.",
        "Beacon 36-Pátio de Enfermagem": "Chegou ao seu destino: Pátio de Enfermagem.",
        "Beacon 37-Beacon 36-Pátio de Enfermagem": "Chegou ao seu destino: Pátio de Enfermagem.",
        "Beacon 38-Beacon 36-Pátio de Enfermagem": "Chegou ao seu destino: Pátio de Enfermagem.",

        "Beacon 33-Beacon 36-WC Piso 2": "Dê aproximadamente 14 passos em direção ao WC Piso 2 e desça 8 degraus à direita.",
        "Beacon 36-WC Piso 2": "Dê aproximadamente 14 passos em frente e chegará ao seu destino: WC Piso 2.",
        "Beacon 37-Beacon 36-WC Piso 2": "Dê aproximadamente 14 passos em frente e chegará ao seu destino: WC Piso 2.",
        "Beacon 38-Beacon 36-WC Piso 2": "Dê aproximadamente 14 passos em frente e chegará ao seu destino: WC Piso 2.",

        "Beacon 36-Beacon 33": "Dê aproximadamente 11 passos em frente e desça 8 degraus à direita.",
        "Beacon 37-Beacon 36-Beacon 33": "Dê aproximadamente 11 passos em frente e desça 8 degraus à direita.",
        "Beacon 38-Beacon 36-Beacon 33": "Dê aproximadamente 11 passos em frente e desça 8 degraus à direita.",

        "Beacon 36-Beacon 37": "Encontre umas escadas e desça 6 degraus.",
        "Beacon 33-Beacon 36-Beacon 37": "Encontre umas escadas e desça 6 degraus.",
        "Beacon 38-Beacon 36-Beacon 37": "Vire à direita, ande aproximadamente 6 passos e desça 6 degraus em frente.",

        "Beacon 36-Beacon 38": "Vire à esquerda, ande aproximadamente 4 passos e suba 11 degraus em frente.",
        "Beacon 33-Beacon 36-Beacon 38": "Ande aproximadamente 4 passos e suba 11 degraus em frente.",
        "Beacon 37-Beacon 36-Beacon 38": "Vire à esquerda, ande 4 passos e suba 11 degraus em frente."
      }
    },

    "Beacon 37": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço encontra-se a Sala 80 e ligações para os pisos superiores e inferiores.",
      "beacon_destinations": ["Sala 80"],
      "beacon_connections": ["Beacon 20", "Beacon 36"],
      "beacon_instructions": {

        "Beacon 20-Beacon 37-Sala 80": "Vire à esquerda e dê aproximadamente 2 passos e chegará ao seu destino: sala 80",
        "Beacon 36-Beacon 37-Sala 80": "Vire à esquerda e dê aproximadamente 2 passos e chegará ao seu destino: sala 80",
        "Beacon 37-Sala 80": "Dê aproximadamente 2 passos em direção à sala 80 e chegará ao seu destino",

        "Beacon 36-Beacon 37-Beacon 20": "Vire à direita e suba 6 degraus seguidos de mais aproximadamente 7 passos em frente",
        "Beacon 37-Beacon 20": "Suba 6 degraus seguidos de mais aproximadamente 7 passos em frente",

        "Beacon 20-Beacon 37-Beacon 36": "Vire à esquerda e desça 15 degraus",
        "Beacon 37-Beacon 36": "Desça 15 degraus"     }
    },

    "Beacon 38": {
      "beacon_floor": "3",
      "beacon_description": "Neste espaço encontra-se o Auditório 01 e a Sala 90.",
      "beacon_destinations": ["Auditório 01", "Sala 90"],
      "beacon_connections": ["Beacon 36"],
      "beacon_instructions": {

        "Beacon 36-Beacon 38-Auditório 01": "Vire à esquerda e dê aproximadamente 3 passos e chegará ao seu destino: Auditório 01",
        "Beacon 38-Auditório 01": "Dê aproximadamente 3 passos em direção ao Auditório 01 e chegará ao seu destino",

        "Beacon 36-Beacon 38-Sala 90": "Vire à esquerda e dê aproximadamente 12 passos seguidos de mais 5 passos à direita e chegará ao seu destino: Sala 90",
        "Beacon 38-Sala 90": "Dê aproximadamente 12 passos seguidos de mais 5 passos em direção à Sala 90 e chegará ao seu destino",

        "Beacon 38-Beacon 36": "Desça 11 degraus em frente"
      }
    }

  },
  "voice_commands": {
    "auditório 01": "Auditório 01",
    "auditório 02": "Auditório 02",
    "auditório 03": "Auditório 03",
    "associação académica": "Associação Académica",
    "bar": "Bar",
    "biblioteca": "Biblioteca",
    "cacifos": "Cacifos",
    "centro de informática": "Centro de Informática",
    "entrada principal": "Entrada Principal",
    "esplanada": "Esplanada",
    "estátua do camões": "Estátua do Camões",
    "gabinete de erasmus": "Gabinete de Erasmus",
    "giru": "GIRU",
    "laboratórios ecc": "Laboratórios ECC",
    "laboratórios de psicologia": "Laboratórios de Psicologia",
    "loja académica": "Loja Académica",
    "livraria": "Livraria",
    "livros de ponto": "Livros de Ponto",
    "pátio": "Pátio",
    "pátio de enfermagem": "Pátio de Enfermagem",
    "perdidos e achados": "Perdidos e Achados",
    "refeitório": "Refeitório",
    "sala 10": "Sala 10",
    "sala 13": "Sala 13",
    "sala 14": "Sala 14",
    "sala 15": "Sala 15",
    "sala 16": "Sala 16",
    "sala 18": "Sala 18",
    "sala 22": "Sala 22",
    "sala 23": "Sala 23",
    "sala 24": "Sala 24",
    "sala 27": "Sala 27",
    "sala 28": "Sala 28",
    "sala 29": "Sala 29",
    "sala 32": "Sala 32",
    "sala 33": "Sala 33",
    "sala 37": "Sala 37",
    "sala 38": "Sala 38",
    "sala 39": "Sala 39",
    "sala 40": "Sala 40",
    "sala 41": "Sala 41",
    "sala 42": "Sala 42",
    "sala 44": "Sala 44",
    "sala 45": "Sala 45",
    "sala 54": "Sala 54",
    "sala 56": "Sala 56",
    "sala 57": "Sala 57",
    "sala 58": "Sala 58",
    "sala 59": "Sala 59",
    "sala 60": "Sala 60",
    "sala 61": "Sala 61",
    "sala 62": "Sala 62",
    "sala 63": "Sala 63",
    "sala 68": "Sala 68",
    "sala 69": "Sala 69",
    "sala 70": "Sala 70",
    "sala 80": "Sala 80",
    "sala 81": "Sala 81",
    "sala 82": "Sala 82",
    "sala 83": "Sala 83",
    "sala 90": "Sala 90",
    "sala dos atos": "Sala dos Atos",
    "sala dos micro-ondas": "Sala dos Micro-ondas",
    "ual media": "UAL Media",
    "wc bar": "WC Bar",
    "wc piso 1": "WC Piso 1",
    "wc piso 2": "WC Piso 2"
  }
}



