{
  "alerts": {
    "guided_tour_start_alert": "Vamos iniciar a Visita Guiada pela Universidade Autónoma de Lisboa",
    "tour_end_alert": "A Visita Guiada chegou ao fim. Obrigado por usar a nossa aplicação!",
    "searching_alert": "A procurar..."
  },
  "beacons": {
    "Beacon 1": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço encontram-se a Sala dos Atos, a Entrada Principal e a zona de Perdidos e Achados.",
      "beacon_destinations": ["Sala dos Atos", "Entrada Principal", "Perdidos e Achados"],
      "beacon_connections": ["Beacon 3"],

      "historical_points": [
        {
          "name": "Entrada Principal",
          "message": "Construído no século XVII pelo Conde de Redondo. Está classificado desde 1974 como Imóvel de Interesse Público (Decreto n.º 735/74). Integra a Zona Especial de Proteção dos edifícios classificados da Avenida da Liberdade e área envolvente (Portaria n.º 529/96). Desde 1985 que aqui funciona a Universidade Autónoma de Lisboa, Luís de Camões.."
        },
        {
          "name": "Perdidos e Achados",
          "message": "Procure o que perdeu e entregue o que encontrou na Portaria do Palácio. "
        },
        {
          "name": "Sala dos Atos",
          "message": "A Sala dos Atos é o local institucional dos grandes atos da vida da Universidade, desde a tomada de posse do Reitor ou Órgãos académicos, mas também lançamento de livros e outros eventos culturais."
        }
      ],

      "beacon_instructions": {
        "Beacon 1-Beacon 3": "Dê aproximadamente três passos e chegará ao seu destino: Pátio."
      }
    },

    "Beacon 3": {
      "beacon_floor": "0",
      "beacon_description": "Está no centro do Pátio Principal da UAL. À sua volta encontra-se a saída da universidade, o busto de Camões e as escadas de acesso ao interior da universidade.",
      "beacon_destinations": ["Pátio"],
      "beacon_connections": ["Beacon 4"],

      "historical_points": [
        {
          "name": "Pátio",
          "message": "O portal do palácio abre para uma larga passagem que conduz ao pátio principal, marcado pela centralidade do poço. Tem fachadas de organização regular, formalmente semelhantes à frontaria exterior, dá acesso ao arco de entrada na escadaria de aparato."
        }
      ],

      "beacon_instructions": {
        "Beacon 1-Beacon 3-Beacon 4": "Dê aproximadamente sete passos à direita e suba pelas escadas da direita oito degraus, seguidos de mais dois degraus à esquerda"
      }
    },

    "Beacon 4": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço, à sua frente está a loja dos trajes académicos, à sua esquerda a Associação de Estudantes e à sua direita as salas vinte e quatro a trinta e três, os auditórios dois e três e o Gabinete de Erasmus.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 3", "Beacon 5"],
      "beacon_instructions": {
        "Beacon 3-Beacon 4-Beacon 5": "Vire à direita e dê aproximadamente 5 passos, seguidos de mais 15 passos à esquerda.",
        "Beacon 5-Beacon 4-Beacon 9": "Dê aproximadamente 13 passos em frente, seguidos de mais 15 passos à esquerda."
      }
    },

    "Beacon 5": {
      "beacon_floor": "0",
      "beacon_description": "Neste corredor encontram-se as salas 24, 27, 28 e 29, por esta ordem. Também encontrará o Gabinete de Erasmus e o Coro Académico.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 4"],

      "historical_points": [
        {
          "name": "Gabinete de Erasmus",
          "message": "Esta sala tem parte das paredes forradas a azulejos e reúne inúmeros exemplares que foram recolhidos ao longo dos anos. Aqui funciona o Gabinete Erasmus."
        }
      ],

      "beacon_instructions": {
        "Beacon 4-Beacon 5-Beacon 4": "Siga do Beacon 4 para o Beacon 5 e depois regresse ao Beacon 4."
      }
    },

    "Beacon 8": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço tem umas escadas que o irão levar ao Pátio Principal, um corredor que o irá levar ao piso 1 e outro corredor que o irá levar a salas, bar e Associação de Estudantes.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 9", "Beacon 22"],
      "beacon_instructions": {
        "Beacon 9-Beacon 8-Beacon 22": "Do Beacon 9, siga para o Beacon 8 e continue até ao Beacon 22."
      }
    },

    "Beacon 9": {
      "beacon_floor": "0",
      "beacon_description": "À sua volta encontra-se a Associação de Estudantes à direita, à sua esquerda a loja dos trajes académicos e em frente as escadas que o levarão ao Bar/Cantina.",
      "beacon_destinations": ["Associação Académica", "Loja Académica"],
      "beacon_connections": ["Beacon 4", "Beacon 8", "Beacon 10"],

      "historical_points": [
        {
          "name": "Associação Académica",
          "message": "A Associação de Estudantes representa os alunos de licenciaturas, pós-graduações, mestrados e doutoramentos, com ideias e espaços culturais e sociais muito diferentes, o que significa uma elevada responsabilidade, e também um grande desafio. Junta-te a nós!"
        }
      ],

      "beacon_instructions": {
        "Beacon 4-Beacon 9-Beacon 10": "Vire à direita e dê aproximadamente 10 passos, desça 6 degraus, seguidos de mais 12 degraus à esquerda.",
        "Beacon 10-Beacon 9-Beacon 8": "Dê aproximadamente 7 passos em frente, seguidos de mais 6 passos à direita."
      }
    },

    "Beacon 10": {
      "beacon_floor": "-1",
      "beacon_description": "Neste espaço encontra-se à sua direita o Bar/Cantina, os Cacifos e em frente as escadas que o irão levar para o piso 0.",
      "beacon_destinations": ["Cacifos", "Bar"],
      "beacon_connections": ["Beacon 9", "Beacon 11", "Beacon 12"],
      "beacon_instructions": {
        "Beacon 9-Beacon 10-Beacon 12": "Dê aproximadamente 3 passos em frente seguidos de mais 4 passos à esquerda. Ao passar por uma porta dê 5 passos.",
        "Beacon 11-Beacon 10-Beacon 9": "Encontre umas escadas e suba 12 degraus seguidos de mais 6 degraus à direita. E dê aproximadamente 5 passos à direita."
      }
    },

    "Beacon 11": {
      "beacon_floor": "-1",
      "beacon_description": "Onde se encontra, tem à sua frente a esplanada exterior, à sua direita o caminho para o bar e atrás de si as escadas que o levam para o piso zero.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 10", "Beacon 13"],
      "beacon_instructions": {
        "Beacon 13-Beacon 11-Beacon 10": "Vire à esquerda e dê aproximadamente 10 passo"
      }
    },

    "Beacon 12": {
      "beacon_floor": "-1",
      "beacon_description": "Neste momento você encontra-se no Bar. À sua esquerda tem a esplanada interior e à sua direita a saída.",
      "beacon_destinations": ["Bar", "Refeitório"],
      "beacon_connections": ["Beacon 10", "Beacon 13"],

      "historical_points": [
        {
          "name": "Bar",
          "message": "Refeições com uma ementa variada. O bar é um ponto de encontro perfeito para relaxar e socializar. \nNa copa existem equipamentos para aquecer comida trazida de casa! \n"
        }
      ],

      "beacon_instructions": {
        "Beacon 10-Beacon 12-Beacon 13": "Vire à esquerda e dê aproximadamente 13 passos"
      }
    },

    "Beacon 13": {
      "beacon_floor": "-1",
      "beacon_description": "Onde se encontra, tem à sua esquerda uma porta que o levará para a secção dos micro-ondas, para a esplanada exterior e para a esplanada interior.",
      "beacon_destinations": ["Sala dos Micro-ondas", "Refeitório", "Esplanada"],
      "beacon_connections": ["Beacon 11", "Beacon 12", "Beacon 14"],
      "beacon_instructions": {
        "Beacon 12-Beacon 13-Beacon 14": "Ao passar por uma porta, vire à direita e dê aproximadamente 19 passos",
        "Beacon 14-Beacon 13-Beacon 11": "Vire à direita e dê aproximadamente 10 passos"
      }
    },

    "Beacon 14": {
      "beacon_floor": "-1",
      "beacon_description": "Neste espaço, tem à sua frente a esplanada exterior e, à sua direita, a entrada da reprografia e as casas de banho.",
      "beacon_destinations": ["Livraria", "Esplanada", "WC Bar"],

      "historical_points": [
        {
          "name": "Livraria",
          "message": "Para aquisição de livros e materiais didáticos, mas também para imprimir documentos ou preparar trabalhos académicos de forma conveniente e eficiente. "
        }
      ],

      "beacon_connections": ["Beacon 13"],
      "beacon_instructions": {
        "Beacon 13-Beacon 14-Beacon 13": "Siga de Beacon 13 passando por Beacon 14 até Beacon 13."
      }
    },

    "Beacon 15": {
      "beacon_floor": "0",
      "beacon_description": "Chegou ao busto de Luís de Camões. À sua direita encontram-se as escadas para as salas 37 a 70, o UAL Media, o Auditório 1, o Centro de Informática e as casas de banho. À sua esquerda encontram-se as escadas para as salas 10, 16 e 18, as salas 80 a 90, a biblioteca e os laboratórios de psicologia. Também encontrará, neste espaço, a porta de acesso ao Pátio Principal.",
      "beacon_destinations": ["Estátua do Camões"],
      "beacon_connections": ["Beacon 3", "Beacon 16", "Beacon 22"],

      "historical_points": [
        {
          "name": "Estátua do Camões",
          "message": "O busto de Luís de Camões, em bronze, é do Mestre Escultor Joaquim Correia datada de 1957, encomendado pela família de Frank Silva e doada à cidade de Toronto.\nO busto foi oficialmente inaugurado a 10 de junho de 1982 numa cerimónia pública presidida por Arthur C. Eggleton, então presidente da Câmara Municipal de Toronto. \nA 30 de maio de 2001, foi reinaugurado pelo Presidente da República Portuguesa de então, Jorge Sampaio e em 2013 por iniciativa do comendador Manuel da Costa, por ocasião do 60.º aniversário da chegada oficial dos portugueses ao Canadá o espaço envolvente foi reformulado dando origem à Camões Square. \nTal como em Toronto a evocação em bronze do patrono da Universidade Autónoma de Lisboa aqui presente relembra a importância do épico para a expansão da cultura e da língua portuguesa.\n"
        }
      ],

      "beacon_instructions": {
        "Beacon 22-Beacon 15-Beacon 16": "Em frente suba 10 degraus"
      }
    },

    "Beacon 16": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço, encontrará umas escadas que, ao subir, dão acesso às salas 80 a 90, à sala 10, aos laboratórios de psicologia, à Autónoma 24, sala de estudos, e à biblioteca. À sua esquerda encontra-se a sala 18. Também encontrará umas escadas que, ao descer, levam à sala 16.",
      "beacon_destinations": ["Sala 10", "Livros de Ponto"],
      "beacon_connections": ["Beacon 15", "Beacon 17", "Beacon 19"],

      "historical_points": [
        {
          "name": "Livros de Ponto",
          "message": "Ponto de informação sobre salas e docentes."
        }
      ],

      "beacon_instructions": {
        "Beacon 15-Beacon 16-Beacon 19": "Encontre umas escadas, suba 7 degraus seguidos de mais 13 degraus à esquerda. Dê aproximadamente 6 passos à esquerda"
      }
    },

    "Beacon 19": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço onde se encontra, tem à sua direita a sala 10, à sua esquerda encontra-se uma escada que dá acesso às salas do piso dois, à biblioteca e à Sala de Computadores.",
      "beacon_destinations": ["Sala 10", "Sala de Computadores", "Biblioteca", "GIRU"],
      "beacon_connections": ["Beacon 16", "Beacon 20", "Beacon 21"],

      "historical_points": [
        {
          "name": "Biblioteca",
          "message": "Estrutura de apoio a professores e estudantes, caracteriza-se por atender às necessidades de informação, de acordo com as áreas de ensino, investigação e aprendizagem.\nÉ um centro de recursos inclusivos, que visa garantir o sucesso académico, promover competências de literacia da informação, apoiar o processo de ensino/aprendizagem e a investigação, de forma presencial e à distância.\n"
        }
      ],

      "beacon_instructions": {
        "Beacon 16-Beacon 19-Beacon 21": "Vire à esquerda e dê 2 passos, encontre umas escadas e suba 10 degraus",
        "Beacon 21-Beacon 19-Beacon 20": "Vire à esquerda e dê aproximadamente 13 passos"
      }
    },

    "Beacon 20": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço à sua frente encontram-se as salas de estudo com computadores e sem, e à sua direita umas escadas para o pátio superior.",
      "beacon_destinations": ["Sala de Estudo", "Sala de Computadores", "GIRU"],
      "beacon_connections": ["Beacon 19", "Beacon 37"],

      "historical_points": [
        {
          "name": "GIRU",
          "message": "Gabinete para a Inclusão e Resiliência Universitária é um recurso de apoio e suporte a todos os alunos que estejam determinados a seguir com o percurso escolar e superar os obstáculos que eventualmente possam surgir, no sentido de potenciar as suas aprendizagens e promover as melhores condições inclusivas."
        }
      ],

      "beacon_instructions": {
        "Beacon 19-Beacon 20-Beacon 37": "Vire à esquerda e dê aproximadamente 13 passos"
      }
    },

    "Beacon 21": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço tem à sua esquerda as salas 82 e 83, o Laboratório de Neurociências e o Laboratório de Psicometria. À sua direita encontram-se as salas 81 e 80, por esta ordem.",
      "beacon_destinations": ["Sala 80", "Sala 81", "Sala 82", "Sala 83", "Laboratórios de Psicologia"],
      "beacon_connections": ["Beacon 19"],

      "historical_points": [
        {
          "name": "Laboratórios de Psicologia",
          "message": "Laboratórios de Psicometria e de Neurociências de apoio às aulas de licenciatura e mestrado em Psicologia."
        }
      ],

      "beacon_instructions": {
        "Beacon 19-Beacon 21-Beacon 19": "Siga de Beacon 19 passando por Beacon 21 até Beacon 19."
      }
    },

    "Beacon 22": {
      "beacon_floor": "0",
      "beacon_description": "Neste espaço você tem as escadas que o irão levar ao piso 1, Pátio Principal e Bar.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 8", "Beacon 15", "Beacon 23"],
      "beacon_instructions": {
        "Beacon 8-Beacon 22-Beacon 15": "Encontre umas escadas, suba 3 degraus, vire à esquerda e desça 4 degraus seguidos de mais 9 degraus."
      }
    },

    "Beacon 23": {
      "beacon_floor": "1",
      "beacon_description": "À sua direita encontram-se as salas 37 a 45, a sala 90 e o auditório 1; à sua esquerda encontram-se as salas 54 a 70, o centro de informática, o UAL Media, as casas de banho e as escadas para regressar ao Pátio Principal.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 22", "Beacon 24", "Beacon 33"],
      "beacon_instructions": {
        "Beacon 33-Beacon 23-Beacon 24": "Dê aproximadamente 11 passos em frente seguidos de mais 6 passos à direita"
      }
    },

    "Beacon 24": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço encontram-se a sala 58, casas de banho e a entrada dos laboratórios de ciências da comunicação.",
      "beacon_destinations": ["Sala 58"],
      "beacon_connections": ["Beacon 23", "Beacon 25", "Beacon 27", "Beacon 28"],
      "beacon_instructions": {
        "Beacon 23-Beacon 24-Beacon 25": "Dê aproximadamente 9 passos em frente seguidos de mais 3 passos à direita."
      }
    },

    "Beacon 25": {
      "beacon_floor": "1",
      "beacon_description": "Nesta área encontram-se os laboratórios de ciências da comunicação, a UAL Media e a sala 56.",
      "beacon_destinations": ["Sala 58", "UAL Media"],
      "beacon_connections": ["Beacon 24", "Beacon 26", "Beacon 27", "Beacon 28"],

      "historical_points": [
        {
          "name": "UAL Media",
          "message": "Estúdios de televisão e rádio dotados de equipamento de topo e redações multiplataforma. Permitem que o ensino teórico seja suportado por uma prática em ambiente de trabalho real."
        }
      ],

      "beacon_instructions": {
        "Beacon 24-Beacon 25-Beacon 28": "Dê aproximadamente 9 passos em frente seguidos de mais 3 passos à direita"
      }
    },

    "Beacon 28": {
      "beacon_floor": "1",
      "beacon_description": "Neste momento você se encontra num corredor em que, por esta respetiva ordem, vai encontrar à sua direita a sala 59 e à sua esquerda as salas 60 e 61.",
      "beacon_destinations": ["Sala 54", "Sala 58", "Sala 59"],
      "beacon_connections": ["Beacon 24", "Beacon 25", "Beacon 27", "Beacon 29"],
      "beacon_instructions": {
        "Beacon 25-Beacon 28-Beacon 29": "Ao passar por uma porta dê aproximadamente 15 passos em frente"
      }
    },

    "Beacon 29": {
      "beacon_floor": "1",
      "beacon_description": "Você neste momento encontra-se no meio do corredor onde tem as salas 60 e 61 à sua esquerda e a sala 59 à sua direita.",
      "beacon_destinations": ["Sala 59", "Sala 60", "Sala 61"],
      "beacon_connections": ["Beacon 28", "Beacon 30"],
      "beacon_instructions": {
        "Beacon 28-Beacon 29-Beacon 30": "Ao passar por uma porta dê aproximadamente 8 passos em frente."
      }
    },

    "Beacon 30": {
      "beacon_floor": "1",
      "beacon_description": "Neste espaço à sua direita está a sala 62 e à sua esquerda encontram-se umas escadas que o irão levar às salas 63 a 70.",
      "beacon_destinations": ["Sala 61", "Sala 62", "Sala 63"],
      "beacon_connections": ["Beacon 29", "Beacon 31"],
      "beacon_instructions": {
        "Beacon 29-Beacon 30-Beacon 31": "Ao passar por uma porta vire à esquerda. Dê aproximadamente 8 passos e suba 8 degraus"
      }
    },

    "Beacon 31": {
      "beacon_floor": "2",
      "beacon_description": "Onde se encontra tem a sala 65 à sua direita e em frente umas escadas que o levarão a salas e ao centro informático.",
      "beacon_destinations": [],
      "beacon_connections": ["Beacon 30", "Beacon 32"],
      "beacon_instructions": {
        "Beacon 30-Beacon 31-Beacon 32": "Vire à esquerda e dê aproximadamente 4 passos. Encontre umas escadas e suba 11 degraus"
      }
    },

    "Beacon 32": {
      "beacon_floor": "2",
      "beacon_description": "Neste corredor encontram-se as salas da 67 à 70 por esta respetiva ordem e o centro de informática.",
      "beacon_destinations": ["Sala 68", "Sala 69", "Sala 70", "Centro de Informática", "Laboratórios ECC"],
      "beacon_connections": ["Beacon 31"],

      "historical_points": [
        {
          "name": "Centro de Informática",
          "message": "O Centro de Informática dá suporte às atividades académicas. Desenvolve funções de gestão, implementação, suporte e promoção da utilização dos serviços e sistemas de informática, comunicações e multimédia. Presta apoio e assistência (local e remoto) sobre todos os seus serviços disponibilizados; assegura o atendimento aos utilizadores dos laboratórios de informática e dos serviços académicos; gere os sistemas de informação e dá suporte aplicacional às unidades académicas e gere as infraestruturas tecnológicas."
        },

        {
          "name": "Laboratórios ECC",
          "message": "Os Laboratórios de Engenharia e Ciências da Comunicação dão suporte aos vários ciclos de estudo. Dividem-se em 5 áreas: Laboratório de Redes e Telecomunicações\nLaboratório de Eletrónica e Sistemas Digitais\nLaboratório de Robótica\nLaboratório de Produção e Distribuição de Energia\nLaboratórios de Programação\n"
        }
      ],

      "beacon_instructions": {
      }
    },

    "Beacon 33": {
      "beacon_floor": "2",
      "beacon_description": "Você está num corredor onde à direita encontram-se as salas 37 e 38 e à esquerda encontra-se o pátio secundário e casas de banho.",
      "beacon_destinations": ["Sala 37", "Sala 38", "WC Piso 2"],
      "beacon_connections": ["Beacon 23", "Beacon 34", "Beacon 36"],
      "beacon_instructions": {
        "Beacon 36-Beacon 33-Beacon 23": "Encontre umas escadas, desça 5 degraus seguidos de 12 degraus. Em seguida dê aproximadamente 7 passos em frente seguidos de mais 5 passos à esquerda"
      }
    },

    "Beacon 36": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço estão o Pátio de Enfermagem e o WC do Piso 2.",
      "beacon_destinations": ["Pátio de Enfermagem", "WC Piso 2"],
      "beacon_connections": ["Beacon 33", "Beacon 37", "Beacon 38"],
      "beacon_instructions": {
        "Beacon 37-Beacon 36-Beacon 38": "Vire à esquerda, ande 4 passos e suba 11 degraus em frente.",
        "Beacon 38-Beacon 36-Beacon 33": "Dê aproximadamente 11 passos em frente e desça 8 degraus à direita."
      }
    },

    "Beacon 37": {
      "beacon_floor": "2",
      "beacon_description": "Neste espaço encontra-se a Sala 80 e ligações para os pisos superiores e inferiores.",
      "beacon_destinations": ["Sala 80"],
      "beacon_connections": ["Beacon 20", "Beacon 36"],
      "beacon_instructions": {
        "Beacon 20-Beacon 37-Beacon 36": "Vire à esquerda e desça 15 degraus."
      }
    },

    "Beacon 38": {
      "beacon_floor": "3",
      "beacon_description": "Neste espaço encontra-se o Auditório 01 e a Sala 90.",
      "beacon_destinations": ["Auditório 01", "Sala 90"],
      "beacon_connections": ["Beacon 36"],

      "historical_points": [
        {
          "name": "Auditório 01",
          "message": "O Auditório 01 da Universidade Autónoma de Lisboa é um espaço de destaque destinado à realização de conferências, palestras, seminários e outros eventos académicos e científicos. Equipado com tecnologias modernas de som e imagem, oferece condições ideais para apresentações formais e sessões de ensino em grande dimensão."
        }
      ],

      "beacon_instructions": {
        "Beacon 36-Beacon 38-Beacon 36": "Siga de Beacon 36 passando por Beacon 38 até Beacon 36."
      }
    }
  },
  "tour_route": [
    "Beacon 1", "Beacon 3", "Beacon 4", "Beacon 5", "Beacon 4",
    "Beacon 9", "Beacon 10", "Beacon 12", "Beacon 13", "Beacon 14",
    "Beacon 13", "Beacon 11", "Beacon 10", "Beacon 9", "Beacon 8",
    "Beacon 22", "Beacon 15", "Beacon 16", "Beacon 19", "Beacon 21",
    "Beacon 19", "Beacon 20", "Beacon 37", "Beacon 36", "Beacon 38",
    "Beacon 36", "Beacon 33", "Beacon 23", "Beacon 24", "Beacon 25",
    "Beacon 28", "Beacon 29", "Beacon 30", "Beacon 31", "Beacon 32"
  ]
}




