{
  "sound_settings_page": {
    "general_preferences": "General Preferences",
    "sound": "Sound",
    "sound_description": "Turn sound on or off.",
    "vibration": "Vibration",
    "vibration_description": "Turn vibration on or off.",
    "voice": "Voice",
    "language": "Voice Language",
    "select_language": "Select Language",
    "current_language": "Current: {language}",
    "voice_speed": "Voice Speed",
    "voice_pitch": "Voice Pitch",
    "test_voice": "Test Voice"
  },
  "settings_page": {
    "settings": "Settings",
    "sound": "Sound",
    "accessibility": "Accessibility",
    "map": "Map",
    "personalization": "Personalization",
    "language": "Language"
  },
  "personalization_page": {
    "theme": "Theme",
    "theme_description": "Switch between light and dark mode.",
    "light_mode": "Light Mode",
    "dark_mode": "Dark Mode"
  },
  "map_settings_page": {
    "map_appearance": "Map Appearance",
    "dark_map": "Dark Map Mode",
    "dark_map_description": "Enable a dark theme.",
    "icon_style": "Icon Style",
    "default_style": "Default",
    "accessible_style": "Accessible"
  },
  "language_settings_page": {
    "language": "Language",
    "language_description": "Select the desired language.",
    "current_language": "Current Language",
    "select_language": "Select Language"
  },
  "accessibility_settings_page": {
    "vision": "Vision",
    "high_contrast": "High Contrast",
    "high_contrast_description": "Increases the contrast between colors to make reading easier.",
    "hearing": "Hearing",
    "screen_reader": "Screen Reader",
    "screen_reader_description": "Enable screen reading of elements on the screen."
  },
  "my_home_page": {
    "mode_navigation": "Navigation Mode",
    "mode_visit": "Visit Mode",
    "welcome": "Autónoma GPS",
    "settings": "Settings",
    "language": "Language"
  },
  "navigation_map_selector": {
    "where_to_go": "Where would you like to go?",
    "select_destination": "Select Destination",
    "start_navigation": "Start Navigation",
    "by_voice": "By Voice",
    "favorites": "Favorites",
    "add_favorite": "Add to Favorites",
    "close_popup": "Close"
  },
  "beacon_scan_page": {
    "destination": "Destination",
    "current_location": "Current Location",
    "next": "Next",
    "description": "Description",
    "cancel_navigation": "Cancel Navigation",
    "navigation_end": "Navigation complete. Thank you for using our application!"
  },
  "tour_page": {
    "guided_tour_title": "Guided Tour",
    "guided_tour_description": "Come explore the Universidade Autónoma de Lisboa through an interactive and historical tour!",
    "start_guided_tour": "Start Tour",
    "guided_tour_info": "About",
    "guided_tour_info_description": "The guided tour allows you to explore interactively and engagingly the main spaces and history of the Universidade Autónoma de Lisboa. Throughout the tour, you will be guided through carefully selected stages that highlight important points of the institution, historical curiosities, and points of interest. This experience provides an enriching and educational way to discover each place at your own pace, allowing you to deepen your knowledge of our university in a dynamic and accessible way.",
    "guided_tour_popup": "What is the Guided Tour?",
    "close_popup": "Close"
  },
  "tour_scan_page": {
    "tour_title": "Guided Tour",
    "cancel_tour": "Cancel Tour",
    "tour_end": "The Guided Tour has ended. Thank you for using our application!"
  },
  "privacy_policy": {
    "title": "Privacy Policy",
    "updated": "Last updated: June 29, 2025",
    "intro": "The Universidade Autónoma de Lisboa values user privacy and is committed to protecting any information that may be shared during the use of the application: Autónoma GPS.",
    "section1_title": "1. Organization Identity",
    "section1_body": "The Universidade Autónoma de Lisboa is the entity responsible for operating the Autónoma GPS application, an indoor navigation solution using BLE beacon technology to help users locate spaces and navigate the university campus. For any questions related to this policy, users can contact us at mmira@autonoma.pt.",
    "section2_title": "2. Personal Data and Collected Information",
    "section2_body": "The Autónoma GPS application does not collect, store, or share personal data from users. The information processed by the application is limited to detecting BLE beacon signals to calculate the user's approximate location in the space. No personal identification, such as name, email address, or phone number, is requested or stored.",
    "section3_title": "3. Purpose of Data Use",
    "section3_body": "The application uses beacon signals exclusively to provide navigation guidance inside the premises. The proximity data from the beacons are processed locally on the device and are only used to determine the user's approximate location and provide real-time navigation instructions. No information is stored or used for other purposes.",
    "section4_title": "4. Data Sharing with Third Parties",
    "section4_body": "The application does not share any data with third parties. The processed beacon signals are used only on the user's device and are not sent to external servers or databases.",
    "section5_title": "5. Security of Interactions",
    "section5_body": "The application processes beacon signals locally, without the need to transmit sensitive data over the internet. If network access is required, communication will be protected by secure SSL/TLS protocols. Best security practices have also been implemented in the development of the application.",
    "section6_title": "6. User Rights",
    "section6_body": "In accordance with the General Data Protection Regulation (GDPR), users have the right to access, correct, or delete their personal data. However, as the Autónoma GPS application does not collect, store, or process identifiable personal data, requests related to accessing, correcting, or deleting data cannot be processed.",
    "section7_title": "7. Changes to Privacy Policy",
    "section7_body": "The Universidade Autónoma de Lisboa reserves the right to update this privacy policy whenever necessary to reflect changes in the application or in compliance with applicable legislation. The date of the last update is indicated at the top of this document.",
    "section8_title": "8. Contact",
    "section8_body": "For any questions related to this privacy policy or the functioning of the Autónoma GPS application, users can contact the Universidade Autónoma de Lisboa via email: mmira@autonoma.pt.",
    "close": "Close"
  }
}
