{
  "sound_settings_page": {
    "general_preferences": "Preferencje ogólne",
    "sound": "Dźwięk",
    "sound_description": "Włącz lub wyłącz dźwięk.",
    "vibration": "Wibracja",
    "vibration_description": "Włącz lub wyłącz wibrację.",
    "voice": "Głos",
    "language": "Język głosu",
    "select_language": "Wybierz język",
    "current_language": "Aktualny: {language}",
    "voice_speed": "Szybkość głosu",
    "voice_pitch": "Ton głosu",
    "test_voice": "Testuj głos"
  },
  "settings_page": {
    "settings": "Ustawienia",
    "sound": "Dźwięk",
    "accessibility": "Dostępność",
    "map": "Mapa",
    "personalization": "Personalizacja",
    "language": "Język"
  },
  "personalization_page": {
    "theme": "Motyw",
    "theme_description": "Zmieniaj między trybem jasnym a ciemnym.",
    "light_mode": "Tryb jasny",
    "dark_mode": "Tryb ciemny"
  },
  "map_settings_page": {
    "map_appearance": "Wygląd mapy",
    "dark_map": "Ciemny tryb mapy",
    "dark_map_description": "Włącz ciemny motyw.",
    "icon_style": "Styl ikon",
    "default_style": "Domyślny",
    "accessible_style": "Dostępny"
  },
  "language_settings_page": {
    "language": "Język",
    "language_description": "Wybierz pożądany język.",
    "current_language": "Aktualny język",
    "select_language": "Wybierz język"
  },
  "accessibility_settings_page": {
    "vision": "Wzrok",
    "high_contrast": "Wysoki kontrast",
    "high_contrast_description": "Zwiększa kontrast między kolorami, aby ułatwić czytanie.",
    "hearing": "Słuch",
    "screen_reader": "Czytnik ekranu",
    "screen_reader_description": "Włącz czytanie na głos elementów na ekranie."
  },
  "my_home_page": {
    "mode_navigation": "Tryb nawigacji",
    "mode_visit": "Tryb zwiedzania",
    "welcome": "Autónoma GPS",
    "settings": "Ustawienia",
    "language": "Język"
  },
  "navigation_map_selector": {
    "where_to_go": "Dokąd chcesz iść?",
    "select_destination": "Wybierz cel",
    "start_navigation": "Rozpocznij nawigację",
    "by_voice": "Głosowo",
    "favorites": "Ulubione",
    "add_favorite": "Dodaj do ulubionych",
    "close_popup": "Zamknij"
  },
  "beacon_scan_page": {
    "destination": "Cel",
    "current_location": "Aktualna lokalizacja",
    "next": "Następny",
    "description": "Opis",
    "cancel_navigation": "Anuluj",
    "navigation_end": "Nawigacja zakończona. Dziękujemy za korzystanie z naszej aplikacji!"
  },
  "tour_page": {
    "guided_tour_title": "Wycieczka z przewodnikiem",
    "guided_tour_description": "Przyjdź i odkryj Universidade Autónoma de Lisboa za pomocą interaktywnej i historycznej wycieczki!",
    "start_guided_tour": "Rozpocznij wycieczkę",
    "guided_tour_info": "O wycieczce",
    "guided_tour_info_description": "Wycieczka z przewodnikiem umożliwia interaktywne i angażujące odkrywanie głównych przestrzeni i historii Universidade Autónoma de Lisboa. Podczas wycieczki będziesz prowadzony przez starannie dobrane etapy, które podkreślają ważne punkty instytucji, historyczne ciekawostki i informacje o interesujących miejscach. To doświadczenie oferuje wzbogacający i edukacyjny sposób na odkrywanie każdego miejsca we własnym tempie, umożliwiając pogłębienie wiedzy na temat naszej uniwersytetu w dynamiczny i dostępny sposób.",
    "guided_tour_popup": "Czym jest wycieczka z przewodnikiem?",
    "close_popup": "Zamknij"
  },
  "tour_scan_page": {
    "tour_title": "Wycieczka z przewodnikiem",
    "cancel_tour": "Anuluj wycieczkę",
    "tour_end": "Wycieczka z przewodnikiem zakończona. Dziękujemy za korzystanie z naszej aplikacji!"
  },
  "privacy_policy": {
    "title": "Polityka prywatności",
    "updated": "Ostatnia aktualizacja: 29 czerwca 2025",
    "intro": "Universidade Autónoma de Lisboa ceni prywatność użytkowników i zobowiązuje się do ochrony wszelkich informacji, które mogą zostać udostępnione podczas korzystania z aplikacji: Autónoma GPS.",
    "section1_title": "1. Tożsamość organizacji",
    "section1_body": "Universidade Autónoma de Lisboa jest podmiotem odpowiedzialnym za funkcjonowanie aplikacji Autónoma GPS, rozwiązania nawigacji wewnętrznej, które wykorzystuje technologię beaconów BLE, aby pomóc użytkownikom w lokalizowaniu przestrzeni i nawigowaniu po terenie uniwersytetu. W przypadku jakichkolwiek pytań związanych z tą polityką, użytkownicy mogą skontaktować się z nami pod adresem mmira@autonoma.pt.",
    "section2_title": "2. Dane osobowe i zebrane informacje",
    "section2_body": "Aplikacja Autónoma GPS nie zbiera, nie przechowuje ani nie udostępnia danych osobowych użytkowników. Informacje przetwarzane przez aplikację ograniczają się do wykrywania sygnału beaconów BLE w celu obliczenia przybliżonej lokalizacji użytkownika w przestrzeni. Żadne dane osobowe, takie jak imię, adres e-mail lub numer telefonu, nie są zbierane ani przechowywane.",
    "section3_title": "3. Cel wykorzystania danych",
    "section3_body": "Aplikacja wykorzystuje sygnały beaconów wyłącznie do zapewnienia wskazówek nawigacyjnych wewnątrz obiektów. Dane dotyczące bliskości beaconów są przetwarzane lokalnie na urządzeniu i służą tylko do określenia przybliżonej lokalizacji użytkownika oraz do udzielania instrukcji nawigacyjnych w czasie rzeczywistym. Żadne informacje nie są przechowywane ani wykorzystywane w innych celach.",
    "section4_title": "4. Udostępnianie danych osobom trzecim",
    "section4_body": "Aplikacja nie udostępnia żadnych danych osobom trzecim. Przetworzone sygnały beaconów są wykorzystywane tylko na urządzeniu użytkownika i nie są wysyłane do zewnętrznych serwerów ani baz danych.",
    "section5_title": "5. Bezpieczeństwo interakcji",
    "section5_body": "Aplikacja przetwarza sygnały beaconów lokalnie, bez konieczności przesyłania wrażliwych danych przez internet. W sytuacjach, gdy wymagany jest dostęp do sieci, komunikacja jest zabezpieczona protokołami SSL/TLS. Podczas tworzenia aplikacji zastosowano również dobre praktyki bezpieczeństwa.",
    "section6_title": "6. Prawa użytkowników",
    "section6_body": "Zgodnie z Ogólnym rozporządzeniem o ochronie danych osobowych (RODO), użytkownicy mają prawo do dostępu, poprawiania lub usuwania swoich danych osobowych. Jednak ponieważ aplikacja Autónoma GPS nie zbiera, nie przechowuje ani nie przetwarza danych osobowych, nie jest możliwe rozpatrzenie wniosków o dostęp, poprawienie lub usunięcie danych.",
    "section7_title": "7. Zmiany w polityce prywatności",
    "section7_body": "Universidade Autónoma de Lisboa zastrzega sobie prawo do aktualizacji niniejszej polityki prywatności w razie potrzeby, aby odzwierciedlić zmiany w aplikacji lub dostosować się do obowiązujących przepisów prawnych. Data ostatniej aktualizacji znajduje się na górze tego dokumentu.",
    "section8_title": "8. Kontakt",
    "section8_body": "W przypadku pytań dotyczących tej polityki prywatności lub funkcjonowania aplikacji Autónoma GPS użytkownicy mogą skontaktować się z Universidade Autónoma de Lisboa pod adresem e-mail: mmira@autonoma.pt.",
    "close": "Zamknij"
  }
}
